[
  {
    "id": "1,1",
    "category": "ARCHITECTURE, DESIGN AND THREAT MODELLING",
    "level": "1",
    "detail": "Verify that all application components are identified and are known to be needed."
  },
  {
    "id": "1,2",
    "category": "ARCHITECTURE, DESIGN AND THREAT MODELLING",
    "level": "2",
    "detail": "Verify that all components, such as libraries, modules, and external systems, that are not part of the application but that the application relies on to operate are identified."
  },
  {
    "id": "1,3",
    "category": "ARCHITECTURE, DESIGN AND THREAT MODELLING",
    "level": "2",
    "detail": "Verify that a high-level architecture for the application has been defined."
  },
  {
    "id": "1,4",
    "category": "ARCHITECTURE, DESIGN AND THREAT MODELLING",
    "level": "3",
    "detail": "Verify that all application components are defined in terms of the business functions and/or security functions they provide."
  },
  {
    "id": "1,5",
    "category": "ARCHITECTURE, DESIGN AND THREAT MODELLING",
    "level": "3",
    "detail": "Verify that all components that are not part of the application but that the application relies on to operate are defined in terms of the functions, and/or security functions, they provide."
  },
  {
    "id": "1,6",
    "category": "ARCHITECTURE, DESIGN AND THREAT MODELLING",
    "level": "3",
    "detail": "Verify that a threat model for the target application has been produced and covers off risks associated with Spoofing, Tampering, Repudiation, Information Disclosure, Denial of Service, and Elevation of privilege (STRIDE)."
  },
  {
    "id": "1,7",
    "category": "ARCHITECTURE, DESIGN AND THREAT MODELLING",
    "level": "2",
    "detail": "Verify all security controls (including libraries that call external security services) have a centralized implementation."
  },
  {
    "id": "1,8",
    "category": "ARCHITECTURE, DESIGN AND THREAT MODELLING",
    "level": "2",
    "detail": "Verify that components are segregated from each other via a defined security control, such as network segmentation, firewall rules, or cloud based security groups."
  },
  {
    "id": "1,9",
    "category": "ARCHITECTURE, DESIGN AND THREAT MODELLING",
    "level": "2",
    "detail": "Verify the application has a clear separation between the data layer, controller layer and the display layer, such that security decisions can be enforced on trusted systems."
  },
  {
    "id": "1,10",
    "category": "ARCHITECTURE, DESIGN AND THREAT MODELLING",
    "level": "2",
    "detail": "Verify that there is no sensitive business logic, secret keys or other proprietary information in client side code."
  },
  {
    "id": "1,11",
    "category": "ARCHITECTURE, DESIGN AND THREAT MODELLING",
    "level": "2",
    "detail": "Verify that all application components, libraries, modules, frameworks, platform, and operating systems are free from known vulnerabilities."
  },
  {
    "id": "2,1",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify all pages and resources by default require authentication except those specifically intended to be public (Principle of complete mediation)."
  },
  {
    "id": "2,2",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify that the application does not automatically fill in credentials – either as hidden fields, URL arguments, Ajax requests, or in forms, as this implies plain text, reversible or de-cryptable password storage. Random time limited nonces are acceptable as stand ins, such as to protect change password forms or forgot password forms."
  },
  {
    "id": "2,4",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify all authentication controls are enforced on the server side."
  },
  {
    "id": "2,6",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify all authentication controls fail securely to ensure attackers cannot log in."
  },
  {
    "id": "2,7",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify password entry fields allow, or encourage, the use of passphrases, and do not prevent password managers, long passphrases or highly complex passwords being entered."
  },
  {
    "id": "2,8",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify all account identity authentication functions (such as update profile, forgot password, disabled / lost token, help desk or IVR) that might regain access to the account are at least as resistant to attack as the primary authentication mechanism."
  },
  {
    "id": "2,9",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify that the changing password functionality includes the old password, the new password, and a password confirmation."
  },
  {
    "id": "2,12",
    "category": "AUTHENTICATION",
    "level": "2",
    "detail": "Verify that all authentication decisions can be logged, without storing sensitive session identifiers or passwords. This should include requests with relevant metadata needed for security investigations."
  },
  {
    "id": "2,13",
    "category": "AUTHENTICATION",
    "level": "2",
    "detail": "Verify that account passwords are one way hashed with a salt, and there is sufficient work factor to defeat brute force and password hash recovery attacks."
  },
  {
    "id": "2,16",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify that credentials are transported using a suitable encrypted link and that all pages/functions that require a user to enter credentials are done so using an encrypted link."
  },
  {
    "id": "2,17",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify that the forgotten password function and other recovery paths do not reveal the current password and that the new password is not sent in clear text to the user."
  },
  {
    "id": "2,18",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify that information enumeration is not possible via login, password reset, or forgot account functionality."
  },
  {
    "id": "2,19",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify there are no default passwords in use for the application framework or any components used by the application (such as “admin/password”)."
  },
  {
    "id": "2,20",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify that anti-automation is in place to prevent breached credential testing, brute forcing, and account lockout attacks."
  },
  {
    "id": "2,21",
    "category": "AUTHENTICATION",
    "level": "2",
    "detail": "Verify that all authentication credentials for accessing services external to the application are encrypted and stored in a protected location."
  },
  {
    "id": "2,22",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify that forgotten password and other recovery paths use a TOTP or other soft token, mobile push, or other offline recovery mechanism. Use of a random value in an e-mail or SMS should be a last resort and is known weak."
  },
  {
    "id": "2,23",
    "category": "AUTHENTICATION",
    "level": "2",
    "detail": "Verify that account lockout is divided into soft and hard lock status, and these are not mutually exclusive. If an account is temporarily soft locked out due to a brute force attack, this should not reset the hard lock status."
  },
  {
    "id": "2,24",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify that if shared knowledge based questions (also known as 'secret questions') are required, the questions do not violate privacy laws and are sufficiently strong to protect accounts from malicious recovery."
  },
  {
    "id": "2,25",
    "category": "AUTHENTICATION",
    "level": "2",
    "detail": "Verify that high value applications can be configured to disallow the use of a configurable number of previous passwords."
  },
  {
    "id": "2,26",
    "category": "AUTHENTICATION",
    "level": "2",
    "detail": "Verify that risk based re-authentication, two factor or transaction signing is in place for high value transactions."
  },
  {
    "id": "2,27",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify that measures are in place to block the use of commonly chosen passwords and weak passphrases."
  },
  {
    "id": "2,28",
    "category": "AUTHENTICATION",
    "level": "3",
    "detail": "Verify that all authentication challenges, whether successful or failed, should respond in the same average response time."
  },
  {
    "id": "2,29",
    "category": "AUTHENTICATION",
    "level": "3",
    "detail": "Verify that secrets, API keys, and passwords are not included in the source code, or online source code repositories."
  },
  {
    "id": "2,31",
    "category": "AUTHENTICATION",
    "level": "2",
    "detail": "Verify that users can enrol and use TOTP verification, two-factor, biometric (Touch ID or similar), or equivalent multi-factor authentication mechanism that provides protection against single factor credential disclosure."
  },
  {
    "id": "2,32",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify that administrative interfaces are not accessible to untrusted parties."
  },
  {
    "id": "2,33",
    "category": "AUTHENTICATION",
    "level": "1",
    "detail": "Verify that the application is compatible with browser based and third party password managers, unless prohibited by risk based policy."
  },
  {
    "id": "3,1",
    "category": "SESSION MANAGEMENT",
    "level": "1",
    "detail": "Verify that there is no custom session manager, or that the custom session manager is resistant against all common session management attacks."
  },
  {
    "id": "3,2",
    "category": "SESSION MANAGEMENT",
    "level": "1",
    "detail": "Verify that sessions are invalidated when the user logs out."
  },
  {
    "id": "3,3",
    "category": "SESSION MANAGEMENT",
    "level": "1",
    "detail": "Verify that sessions timeout after a specified period of inactivity."
  },
  {
    "id": "3,4",
    "category": "SESSION MANAGEMENT",
    "level": "2",
    "detail": "Verify that sessions timeout after an administratively-configurable maximum time period regardless of activity (an absolute timeout)."
  },
  {
    "id": "3,5",
    "category": "SESSION MANAGEMENT",
    "level": "1",
    "detail": "Verify that all pages that require authentication have easy and visible access to logout functionality."
  },
  {
    "id": "3,6",
    "category": "SESSION MANAGEMENT",
    "level": "1",
    "detail": "Verify that the session id is never disclosed in URLs, error messages, or logs. This includes verifying that the application does not support URL rewriting of session cookies."
  },
  {
    "id": "3,7",
    "category": "SESSION MANAGEMENT",
    "level": "1",
    "detail": "Verify that all successful authentication and re-authentication generates a new session and session id."
  },
  {
    "id": "3,10",
    "category": "SESSION MANAGEMENT",
    "level": "2",
    "detail": "Verify that only session ids generated by the application framework are recognized as active by the application."
  },
  {
    "id": "3,11",
    "category": "SESSION MANAGEMENT",
    "level": "1",
    "detail": "Verify that session ids are sufficiently long, random and unique across the correct active session base."
  },
  {
    "id": "3,12",
    "category": "SESSION MANAGEMENT",
    "level": "1",
    "detail": "Verify that session ids stored in cookies have their path set to an appropriately restrictive value for the application, and authentication session tokens additionally set the “HttpOnly” and “secure” attributes"
  },
  {
    "id": "3,16",
    "category": "SESSION MANAGEMENT",
    "level": "3",
    "detail": "Verify that high value applications limit the number of active concurrent sessions."
  },
  {
    "id": "3,17",
    "category": "SESSION MANAGEMENT",
    "level": "2",
    "detail": "Verify that an active session list is displayed in the account profile or similar of each user. The user should be able to terminate any active session."
  },
  {
    "id": "3,18",
    "category": "SESSION MANAGEMENT",
    "level": "3",
    "detail": "Verify the for high value applications, that the user is prompted with the option to terminate all other active sessions after a successful change password process."
  },
  {
    "id": "4,1",
    "category": "ACCESS CONTROL",
    "level": "1",
    "detail": "Verify that the principle of least privilege exists - users should only be able to access functions, data files, URLs, controllers, services, and other resources, for which they possess specific authorization. This implies protection against spoofing and elevation of privilege."
  },
  {
    "id": "4,4",
    "category": "ACCESS CONTROL",
    "level": "1",
    "detail": "Verify that access to sensitive records is protected, such that only authorized objects or data is accessible to each user (for example, protect against users tampering with a parameter to see or alter another user's account). "
  },
  {
    "id": "4,5",
    "category": "ACCESS CONTROL",
    "level": "1",
    "detail": "Verify that directory browsing is disabled unless deliberately desired. Additionally, applications should not allow discovery or disclosure of file or directory metadata, such as Thumbs.db, .DS_Store, .git or .svn folders."
  },
  {
    "id": "4,8",
    "category": "ACCESS CONTROL",
    "level": "1",
    "detail": "Verify that access controls fail securely."
  },
  {
    "id": "4,9",
    "category": "ACCESS CONTROL",
    "level": "1",
    "detail": "Verify that the same access control rules implied by the presentation layer are enforced on the server side."
  },
  {
    "id": "4,10",
    "category": "ACCESS CONTROL",
    "level": "2",
    "detail": "Verify that all user and data attributes and policy information used by access controls cannot be manipulated by end users unless specifically authorized."
  },
  {
    "id": "4,11",
    "category": "ACCESS CONTROL",
    "level": "3",
    "detail": "Verify that there is a centralized mechanism (including libraries that call external authorization services) for protecting access to each type of protected resource."
  },
  {
    "id": "4,12",
    "category": "ACCESS CONTROL",
    "level": "2",
    "detail": "Verify that all access control decisions can be logged and all failed decisions are logged."
  },
  {
    "id": "4,13",
    "category": "ACCESS CONTROL",
    "level": "1",
    "detail": "Verify that the application or framework uses strong random anti-CSRF tokens or has another transaction protection mechanism. "
  },
  {
    "id": "4,14",
    "category": "ACCESS CONTROL",
    "level": "2",
    "detail": "Verify the system can protect against aggregate or continuous access of secured functions, resources, or data. For example, consider the use of a resource governor to limit the number of edits per hour or to prevent the entire database from being scraped by an individual user."
  },
  {
    "id": "4,15",
    "category": "ACCESS CONTROL",
    "level": "2",
    "detail": "Verify the application has additional authorization (such as step up or adaptive authentication) for lower value systems, and / or segregation of duties for high value applications to enforce anti-fraud controls as per the risk of application and past fraud."
  },
  {
    "id": "4,16",
    "category": "ACCESS CONTROL",
    "level": "1",
    "detail": "Verify that the application correctly enforces context-sensitive authorisation so as to not allow unauthorised manipulation by means of parameter tampering. "
  },
  {
    "id": "5,1",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "1",
    "detail": "Verify that the runtime environment is not susceptible to buffer overflows, or that security controls prevent buffer overflows."
  },
  {
    "id": "5,3",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "1",
    "detail": "Verify that server side input validation failures result in request rejection and are logged."
  },
  {
    "id": "5,5",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "1",
    "detail": "Verify that input validation routines are enforced on the server side. "
  },
  {
    "id": "5,6",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "3",
    "detail": "Verify that a single input validation control is used by the application for each type of data that is accepted."
  },
  {
    "id": "5,10",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "1",
    "detail": "Verify that all SQL queries, HQL, OSQL, NOSQL and stored procedures, calling of stored procedures are protected by the use of prepared statements or query parameterization, and thus not susceptible to SQL injection "
  },
  {
    "id": "5,11",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "1",
    "detail": "Verify that the application is not susceptible to LDAP Injection, or that security controls prevent LDAP Injection. "
  },
  {
    "id": "5,12",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "1",
    "detail": "Verify that the application is not susceptible to OS Command Injection, or that security controls prevent OS Command Injection."
  },
  {
    "id": "5,13",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "1",
    "detail": "Verify that the application is not susceptible to Remote File Inclusion (RFI) or Local File Inclusion (LFI) when content is used that is a path to a file. "
  },
  {
    "id": "5,14",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "1",
    "detail": "Verify that the application is not susceptible to common XML attacks, such as XPath query tampering, XML External Entity attacks, and XML injection attacks. "
  },
  {
    "id": "5,15",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "1",
    "detail": "Verify that all string variables placed into HTML or other web client code is either properly contextually encoded manually, or utilize templates that automatically contextually encode to ensure the application is not susceptible to reflected, stored or DOM Cross-Site Scripting (XSS) attacks."
  },
  {
    "id": "5,16",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "2",
    "detail": "Verify that if the application framework allows automatic mass parameter assignment (also called automatic variable binding) from the inbound request to a model, verify that security sensitive fields such as “accountBalance”, “role” or “password” are protected from malicious automatic binding."
  },
  {
    "id": "5,17",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "2",
    "detail": "Verify that the application has defenses against HTTP parameter pollution attacks, particularly if the application framework makes no distinction about the source of request parameters (GET, POST, cookies, headers, environment, etc.)"
  },
  {
    "id": "5,18",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "2",
    "detail": "Verify that client side validation is used as a second line of defense, in addition to server side validation."
  },
  {
    "id": "5,19",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "2",
    "detail": "Verify that all input data is validated, not only HTML form fields but all sources of input such as REST calls, query parameters, HTTP headers, cookies, batch files, RSS feeds, etc; using positive validation (whitelisting), then lesser forms of validation such as grey listing (eliminating known bad strings), or rejecting bad inputs (blacklisting)."
  },
  {
    "id": "5,20",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "2",
    "detail": "Verify that structured data is strongly typed and validated against a defined schema including allowed characters, length and pattern (e.g. credit card numbers or telephone, or validating that two related fields are reasonable, such as validating suburbs and zip or post codes match). "
  },
  {
    "id": "5,21",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "2",
    "detail": "Verify that unstructured data is sanitized to enforce generic safety measures such as allowed characters and length, and characters potentially harmful in given context should be escaped (e.g. natural names with Unicode or apostrophes, such as ねこ or O'Hara)"
  },
  {
    "id": "5,22",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "1",
    "detail": "Verify that untrusted HTML from WYSIWYG editors or similar are properly sanitized with an HTML sanitizer and handle it appropriately according to the input validation task and encoding task. "
  },
  {
    "id": "5,23",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "2",
    "detail": "Verify that where an application uses auto-escaping templating AND auto-escaping is disabled, output should be manually contextually encoded or sanitized to prevent XSS."
  },
  {
    "id": "5,24",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "2",
    "detail": "Verify that where data is transferred from one DOM context to another, the transfer uses safe JavaScript methods, such as using innerText or .val."
  },
  {
    "id": "5,25",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "2",
    "detail": "Verify when parsing JSON in browsers, that JSON.parse is used to parse JSON on the client. Do not use eval() to parse JSON on the client."
  },
  {
    "id": "5,26",
    "category": "MALICIOUS INPUT HANDLING",
    "level": "2",
    "detail": "Verify that authenticated data is cleared from client storage, such as the browser DOM, after the session is terminated."
  },
  {
    "id": "7,2",
    "category": "CRYPTOGRAPHY AT REST",
    "level": "1",
    "detail": "Verify that all cryptographic modules fail securely, and errors are handled in a way that does not enable Padding Oracle."
  },
  {
    "id": "7,6",
    "category": "CRYPTOGRAPHY AT REST",
    "level": "2",
    "detail": "Verify that all random numbers, random file names, random GUIDs, and random strings are generated using the cryptographic module’s approved random number generator when these random values are intended to be not guessable by an attacker."
  },
  {
    "id": "7,7",
    "category": "CRYPTOGRAPHY AT REST",
    "level": "1",
    "detail": "Verify that cryptographic algorithms used by the application have been validated against FIPS 140-2 or an equivalent standard."
  },
  {
    "id": "7,8",
    "category": "CRYPTOGRAPHY AT REST",
    "level": "3",
    "detail": "Verify that cryptographic modules operate in their approved mode according to their published security policies."
  },
  {
    "id": "7,9",
    "category": "CRYPTOGRAPHY AT REST",
    "level": "2",
    "detail": "Verify that there is an explicit policy for how cryptographic keys are managed (e.g., generated, distributed, revoked, and expired). Verify that this key lifecycle is properly enforced."
  },
  {
    "id": "7,11",
    "category": "CRYPTOGRAPHY AT REST",
    "level": "3",
    "detail": "Verify that all consumers of cryptographic services do not have direct access to key material. Isolate cryptographic processes, including master secrets and consider the use of a virtualized or physical hardware key vault (HSM)."
  },
  {
    "id": "7,12",
    "category": "CRYPTOGRAPHY AT REST",
    "level": "2",
    "detail": "Verify that sensitive and Personally Identifiable Information is stored encrypted at rest, and in transit."
  },
  {
    "id": "7,13",
    "category": "CRYPTOGRAPHY AT REST",
    "level": "2",
    "detail": "Verify that sensitive passwords or key material maintained in memory is overwritten with zeros as soon as it is no longer required, to mitigate memory dumping attacks."
  },
  {
    "id": "7,14",
    "category": "CRYPTOGRAPHY AT REST",
    "level": "2",
    "detail": "Verify that all keys and passwords are replaceable, and are generated or replaced at installation time."
  },
  {
    "id": "7,15",
    "category": "CRYPTOGRAPHY AT REST",
    "level": "3",
    "detail": "Verify that random numbers are created with proper entropy even when the application is under heavy load, or that the application degrades gracefully in such circumstances."
  },
  {
    "id": "8,1",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "1",
    "detail": "Verify that the application does not output error messages or stack traces containing sensitive data that could assist an attacker, including session id, software/framework versions and personal information"
  },
  {
    "id": "8,2",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "2",
    "detail": "Verify that error handling logic in security controls denies access by default."
  },
  {
    "id": "8,3",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "2",
    "detail": "Verify security logging controls provide the ability to log success and particularly failure events that are identified as security-relevant."
  },
  {
    "id": "8,4",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "2",
    "detail": "Verify that each log event includes necessary information that would allow for a detailed investigation of the timeline when an event happens."
  },
  {
    "id": "8,5",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "2",
    "detail": "Verify that all events that include untrusted data will not execute as code in the intended log viewing software."
  },
  {
    "id": "8,6",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "2",
    "detail": "Verify that security logs are protected from unauthorized access and modification."
  },
  {
    "id": "8,7",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "2",
    "detail": "Verify that the application does not log sensitive data as defined under local privacy laws or regulations, organizational sensitive data as defined by a risk assessment, or sensitive authentication data that could assist an attacker, including user’s session identifiers, passwords, hashes, or API tokens."
  },
  {
    "id": "8,8",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "3",
    "detail": "Verify that all non-printable symbols and field separators are properly encoded in log entries, to prevent log injection."
  },
  {
    "id": "8,9",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "3",
    "detail": "Verify that log fields from trusted and untrusted sources are distinguishable in log entries."
  },
  {
    "id": "8,10",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "1",
    "detail": "Verify that an audit log or similar allows for non-repudiation of key transactions."
  },
  {
    "id": "8,11",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "3",
    "detail": "Verify that security logs have some form of integrity checking or controls to prevent unauthorized modification."
  },
  {
    "id": "8,12",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "3",
    "detail": "Verify that logs are stored on a different partition than the application is running with proper log rotation."
  },
  {
    "id": "8,13",
    "category": "ERROR HANDLING AND LOGGING",
    "level": "1",
    "detail": "Verify that time sources are synchronized to the correct time and time zone."
  },
  {
    "id": "9,1",
    "category": "DATA PROTECTION",
    "level": "1",
    "detail": "Verify that all forms containing sensitive information have disabled client side caching, including autocomplete features."
  },
  {
    "id": "9,2",
    "category": "DATA PROTECTION",
    "level": "3",
    "detail": "Verify that the list of sensitive data processed by the application is identified, and that there is an explicit policy for how access to this data must be controlled, encrypted and enforced under relevant data protection directives."
  },
  {
    "id": "9,3",
    "category": "DATA PROTECTION",
    "level": "1",
    "detail": "Verify that all sensitive data is sent to the server in the HTTP message body or headers (i.e., URL parameters are never used to send sensitive data)."
  },
  {
    "id": "9,4",
    "category": "DATA PROTECTION",
    "level": "1",
    "detail": "Verify that the application sets sufficient anti-caching headers such that any sensitive and personal information displayed by the application or entered by the user should not be cached on disk by mainstream modern browsers (e.g. visit about:cache to review disk cache)."
  },
  {
    "id": "9,5",
    "category": "DATA PROTECTION",
    "level": "2",
    "detail": "Verify that on the server, all cached or temporary copies of sensitive data stored are protected from unauthorized access or purged/invalidated after the authorized user accesses the sensitive data."
  },
  {
    "id": "9,6",
    "category": "DATA PROTECTION",
    "level": "3",
    "detail": "Verify that there is a method to remove each type of sensitive data from the application at the end of the required retention policy."
  },
  {
    "id": "9,7",
    "category": "DATA PROTECTION",
    "level": "2",
    "detail": "Verify the application minimizes the number of parameters in a request, such as hidden fields, Ajax variables, cookies and header values."
  },
  {
    "id": "9,8",
    "category": "DATA PROTECTION",
    "level": "3",
    "detail": "Verify the application has the ability to detect and alert on abnormal numbers of requests for data harvesting for an example screen scraping."
  },
  {
    "id": "9,9",
    "category": "DATA PROTECTION",
    "level": "1",
    "detail": "Verify that data stored in client side storage (such as HTML5 local storage, session storage, IndexedDB, regular cookies or Flash cookies) does not contain sensitive data or PII."
  },
  {
    "id": "9,10",
    "category": "DATA PROTECTION",
    "level": "2",
    "detail": "Verify accessing sensitive data is logged, if the data is collected under relevant data protection directives or where logging of accesses is required."
  },
  {
    "id": "9,11",
    "category": "DATA PROTECTION",
    "level": "2",
    "detail": "Verify that sensitive information maintained in memory is overwritten with zeros as soon as it is no longer required, to mitigate memory dumping attacks."
  },
  {
    "id": "10,1",
    "category": "COMMUNICATIONS SECURITY",
    "level": "1",
    "detail": "Verify that a path can be built from a trusted CA to each Transport Layer Security (TLS) server certificate, and that each server certificate is valid."
  },
  {
    "id": "10,3",
    "category": "COMMUNICATIONS SECURITY",
    "level": "1",
    "detail": "Verify that TLS is used for all connections (including both external and backend connections) that are authenticated or that involve sensitive data or functions, and does not fall back to insecure or unencrypted protocols. Ensure the strongest alternative is the preferred algorithm."
  },
  {
    "id": "10,4",
    "category": "COMMUNICATIONS SECURITY",
    "level": "3",
    "detail": "Verify that backend TLS connection failures are logged."
  },
  {
    "id": "10,5",
    "category": "COMMUNICATIONS SECURITY",
    "level": "3",
    "detail": "Verify that certificate paths are built and verified for all client certificates using configured trust anchors and revocation information."
  },
  {
    "id": "10,6",
    "category": "COMMUNICATIONS SECURITY",
    "level": "2",
    "detail": "Verify that all connections to external systems that involve sensitive information or functions are authenticated."
  },
  {
    "id": "10,8",
    "category": "COMMUNICATIONS SECURITY",
    "level": "3",
    "detail": "Verify that there is a single standard TLS implementation that is used by the application that is configured to operate in an approved mode of operation."
  },
  {
    "id": "10,10",
    "category": "COMMUNICATIONS SECURITY",
    "level": "2",
    "detail": "Verify that TLS certificate public key pinning (HPKP) is implemented with production and backup public keys. For more information, please see the references below."
  },
  {
    "id": "10,11",
    "category": "COMMUNICATIONS SECURITY",
    "level": "1",
    "detail": "Verify that HTTP Strict Transport Security headers are included on all requests and for all subdomains, such as Strict-Transport-Security: max-age=15724800; includeSubdomains"
  },
  {
    "id": "10,12",
    "category": "COMMUNICATIONS SECURITY",
    "level": "3",
    "detail": "Verify that production website URL has been submitted to preloaded list of Strict Transport Security domains maintained by web browser vendors. Please see the references below."
  },
  {
    "id": "10,13",
    "category": "COMMUNICATIONS SECURITY",
    "level": "1",
    "detail": "Verify that perfect forward secrecy is configured to mitigate passive attackers recording traffic."
  },
  {
    "id": "10,14",
    "category": "COMMUNICATIONS SECURITY",
    "level": "1",
    "detail": "Verify that proper certification revocation, such as Online Certificate Status Protocol (OCSP) Stapling, is enabled and configured."
  },
  {
    "id": "10,15",
    "category": "COMMUNICATIONS SECURITY",
    "level": "1",
    "detail": "Verify that only strong algorithms, ciphers, and protocols are used, through all the certificate hierarchy, including root and intermediary certificates of your selected certifying authority."
  },
  {
    "id": "10,16",
    "category": "COMMUNICATIONS SECURITY",
    "level": "1",
    "detail": "Verify that the TLS settings are in line with current leading practice, particularly as common configurations, ciphers, and algorithms become insecure."
  },
  {
    "id": "11,1",
    "category": "HTTP SECURITY CONFIGURATION",
    "level": "1",
    "detail": "Verify that the application accepts only a defined set of required HTTP request methods, such as GET and POST are accepted, and unused methods (e.g. TRACE, PUT, and DELETE) are explicitly blocked."
  },
  {
    "id": "11,2",
    "category": "HTTP SECURITY CONFIGURATION",
    "level": "1",
    "detail": "Verify that every HTTP response contains a content type header specifying a safe character set (e.g., UTF-8, ISO 8859-1)."
  },
  {
    "id": "11,3",
    "category": "HTTP SECURITY CONFIGURATION",
    "level": "2",
    "detail": "Verify that HTTP headers added by a trusted proxy or SSO devices, such as a bearer token, are authenticated by the application."
  },
  {
    "id": "11,4",
    "category": "HTTP SECURITY CONFIGURATION",
    "level": "2",
    "detail": "Verify that a suitable X-FRAME-OPTIONS header is in use for sites where content should not be viewed in a 3rd-party X-Frame."
  },
  {
    "id": "11,5",
    "category": "HTTP SECURITY CONFIGURATION",
    "level": "1",
    "detail": "Verify that the HTTP headers or any part of the HTTP response do not expose detailed version information of system components."
  },
  {
    "id": "11,6",
    "category": "HTTP SECURITY CONFIGURATION",
    "level": "1",
    "detail": "Verify that all API responses contain X-Content-Type-Options: nosniff and Content-Disposition: attachment; filename='api.json' (or other appropriate filename for the content type)."
  },
  {
    "id": "11,7",
    "category": "HTTP SECURITY CONFIGURATION",
    "level": "1",
    "detail": "Verify that a content security policy (CSPv2) is in place that helps mitigate common DOM, XSS, JSON, and JavaScript injection vulnerabilities."
  },
  {
    "id": "11,8",
    "category": "HTTP SECURITY CONFIGURATION",
    "level": "1",
    "detail": "Verify that the X-XSS-Protection: 1; mode=block header is in place to enable browser reflected XSS filters."
  },
  {
    "id": "13,1",
    "category": "MALICIOUS CONTROLS",
    "level": "3",
    "detail": "Verify all malicious activity is adequately sandboxed, containerized or isolated to delay and deter attackers from attacking other applications."
  },
  {
    "id": "13,2",
    "category": "MALICIOUS CONTROLS",
    "level": "3",
    "detail": "Verify that the application source code, and as many third party libraries as possible, does not contain back doors, Easter eggs, and logic flaws in authentication, access control, input validation, and the business logic of high value transactions."
  },
  {
    "id": "15,1",
    "category": "BUSINESS LOGIC",
    "level": "2",
    "detail": "Verify the application will only process business logic flows in sequential step order, with all steps being processed in realistic human time, and not process out of order, skipped steps, process steps from another user, or too quickly submitted transactions."
  },
  {
    "id": "15,2",
    "category": "BUSINESS LOGIC",
    "level": "2",
    "detail": "Verify the application has business limits and correctly enforces on a per user basis, with configurable alerting and automated reactions to automated or unusual attack."
  },
  {
    "id": "16,1",
    "category": "FILES AND RESOURCES",
    "level": "1",
    "detail": "Verify that URL redirects and forwards only allow whitelisted destinations, or show a warning when redirecting to potentially untrusted content."
  },
  {
    "id": "16,2",
    "category": "FILES AND RESOURCES",
    "level": "1",
    "detail": "Verify that untrusted file data submitted to the application is not used directly with file I/O commands, particularly to protect against path traversal, local file include, file mime type, reflective file download, and OS command injection vulnerabilities."
  },
  {
    "id": "16,3",
    "category": "FILES AND RESOURCES",
    "level": "1",
    "detail": "Verify that files obtained from untrusted sources are validated to be of expected type and scanned by antivirus scanners to prevent upload of known malicious content."
  },
  {
    "id": "16,4",
    "category": "FILES AND RESOURCES",
    "level": "1",
    "detail": "Verify that untrusted data is not used within inclusion, class loader, or reflection capabilities to prevent remote/local code execution vulnerabilities."
  },
  {
    "id": "16,5",
    "category": "FILES AND RESOURCES",
    "level": "1",
    "detail": "Verify that untrusted data is not used within cross-domain resource sharing (CORS) to protect against arbitrary remote content."
  },
  {
    "id": "16,6",
    "category": "FILES AND RESOURCES",
    "level": "2",
    "detail": "Verify that files obtained from untrusted sources are stored outside the webroot, with limited permissions, preferably with strong validation."
  },
  {
    "id": "16,7",
    "category": "FILES AND RESOURCES",
    "level": "2",
    "detail": "Verify that the web or application server is configured by default to deny access to remote resources or systems outside the web or application server."
  },
  {
    "id": "16,8",
    "category": "FILES AND RESOURCES",
    "level": "1",
    "detail": "Verify the application code does not execute uploaded data obtained from untrusted sources."
  },
  {
    "id": "16,9",
    "category": "FILES AND RESOURCES",
    "level": "1",
    "detail": "Verify that unsupported, insecure or deprecated client-side technologies are not used, such as NSAPI plugins, Flash, Shockwave, Active-X, Silverlight, NACL, or client-side Java applets."
  },
  {
    "id": "17,1",
    "category": "MOBILE",
    "level": "1",
    "detail": "Verify that ID values stored on the device and retrievable by other applications, such as the UDID or IMEI number are not used as authentication tokens."
  },
  {
    "id": "17,2",
    "category": "MOBILE",
    "level": "1",
    "detail": "Verify that the mobile app does not store sensitive data onto potentially unencrypted shared resources on the device (e.g. SD card or shared folders)."
  },
  {
    "id": "17,3",
    "category": "MOBILE",
    "level": "1",
    "detail": "Verify that sensitive data is not stored unprotected on the device, even in system protected areas such as key chains."
  },
  {
    "id": "17,4",
    "category": "MOBILE",
    "level": "1",
    "detail": "Verify that secret keys, API tokens, or passwords are dynamically generated in mobile applications."
  },
  {
    "id": "17,5",
    "category": "MOBILE",
    "level": "2",
    "detail": "Verify that the mobile app prevents leaking of sensitive information (for example, screenshots are saved of the current application as the application is backgrounded or writing sensitive information in console)."
  },
  {
    "id": "17,6",
    "category": "MOBILE",
    "level": "2",
    "detail": "Verify that the application is requesting minimal permissions for required functionality and resources."
  },
  {
    "id": "17,7",
    "category": "MOBILE",
    "level": "1",
    "detail": "Verify that the application sensitive code is laid out unpredictably in memory (For example ASLR)."
  },
  {
    "id": "17,8",
    "category": "MOBILE",
    "level": "3",
    "detail": "Verify that there are anti-debugging techniques present that are sufficient enough to deter or delay likely attackers from injecting debuggers into the mobile app (For example GDB)."
  },
  {
    "id": "17,9",
    "category": "MOBILE",
    "level": "1",
    "detail": "Verify that the app does not export sensitive activities, intents, or content providers for other mobile apps on the same device to exploit."
  },
  {
    "id": "17,10",
    "category": "MOBILE",
    "level": "2",
    "detail": "Verify that sensitive information maintained in memory is overwritten with zeros as soon as it is no longer required, to mitigate memory dumping attacks."
  },
  {
    "id": "17,11",
    "category": "MOBILE",
    "level": "1",
    "detail": "Verify that the app validates input to exported activities, intents, or content providers."
  },
  {
    "id": "18,1",
    "category": "WEB SERVICES",
    "level": "1",
    "detail": "Verify that the same encoding style is used between the client and the server."
  },
  {
    "id": "18,2",
    "category": "WEB SERVICES",
    "level": "1",
    "detail": "Verify that access to administration and management functions within the Web Service Application is limited to web service administrators."
  },
  {
    "id": "18,3",
    "category": "WEB SERVICES",
    "level": "1",
    "detail": "Verify that XML or JSON schema is in place and verified before accepting input."
  },
  {
    "id": "18,4",
    "category": "WEB SERVICES",
    "level": "1",
    "detail": "Verify that all input is limited to an appropriate size limit."
  },
  {
    "id": "18,5",
    "category": "WEB SERVICES",
    "level": "1",
    "detail": "Verify that SOAP based web services are compliant with Web Services-Interoperability (WS-I) Basic Profile at minimum. This essentially means TLS encryption."
  },
  {
    "id": "18,6",
    "category": "WEB SERVICES",
    "level": "1",
    "detail": "Verify the use of session-based authentication and authorization. Please refer to sections 2, 3 and 4 for further guidance. Avoid the use of static 'API keys' and similar."
  },
  {
    "id": "18,7",
    "category": "WEB SERVICES",
    "level": "1",
    "detail": "Verify that the REST service is protected from Cross-Site Request Forgery via the use of at least one or more of the following: ORIGIN checks, double submit cookie pattern, CSRF nonces, and referrer checks."
  },
  {
    "id": "18,8",
    "category": "WEB SERVICES",
    "level": "2",
    "detail": "Verify the REST service explicitly check the incoming Content-Type to be the expected one, such as application/xml or application/json."
  },
  {
    "id": "18,9",
    "category": "WEB SERVICES",
    "level": "2",
    "detail": "Verify that the message payload is signed to ensure reliable transport between client and service, using JSON Web Signing or WS-Security for SOAP requests."
  },
  {
    "id": "18,10",
    "category": "WEB SERVICES",
    "level": "2",
    "detail": "Verify that alternative and less secure access paths do not exist."
  },
  {
    "id": "19,1",
    "category": "CONFIGURATION",
    "level": "1",
    "detail": "Verify that all components are up to date with proper security configuration(s) and version(s). This should include removal of unneeded configurations and folders such as sample applications, platform documentation, and default or example users. "
  },
  {
    "id": "19,2",
    "category": "CONFIGURATION",
    "level": "2",
    "detail": "Verify that communications between components, such as between the application server and the database server, are encrypted, particularly when the components are in different containers or on different systems."
  },
  {
    "id": "19,3",
    "category": "CONFIGURATION",
    "level": "2",
    "detail": "Verify that communications between components, such as between the application server and the database server, is authenticated using an account with the least necessary privileges."
  },
  {
    "id": "19,4",
    "category": "CONFIGURATION",
    "level": "2",
    "detail": "Verify application deployments are adequately sandboxed, containerized or isolated to delay and deter attackers from attacking other applications."
  },
  {
    "id": "19,5",
    "category": "CONFIGURATION",
    "level": "2",
    "detail": "Verify that the application build and deployment processes are performed in a secure and repeatable method, such as CI / CD automation and automated configuration management."
  },
  {
    "id": "19,6",
    "category": "CONFIGURATION",
    "level": "3",
    "detail": "Verify that authorised administrators have the capability to verify the integrity of all security-relevant configurations to detect tampering."
  },
  {
    "id": "19,7",
    "category": "CONFIGURATION",
    "level": "3",
    "detail": "Verify that all application components are signed."
  },
  {
    "id": "19,8",
    "category": "CONFIGURATION",
    "level": "3",
    "detail": "Verify that third party components come from trusted repositories."
  },
  {
    "id": "19,9",
    "category": "CONFIGURATION",
    "level": "3",
    "detail": "Verify that build processes for system level languages have all security flags enabled, such as ASLR, DEP, and security checks."
  },
  {
    "id": "19,10",
    "category": "CONFIGURATION",
    "level": "3",
    "detail": "Verify that all application assets are hosted by the application, such as JavaScript libraries, CSS stylesheets and web fonts are hosted by the application rather than rely on a CDN or external provider."
  },
  {
    "id": "19,11",
    "category": "CONFIGURATION",
    "level": "2",
    "detail": "Verify that all application components, services, and servers each use their own low privilege service account, that is not shared between applications nor used by administrators."
  },
  {
    "id": "20,1",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "1",
    "detail": "Verify that application layer debugging interfaces such USB or serial are disabled."
  },
  {
    "id": "20,2",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "1",
    "detail": "Verify that cryptographic keys are unique to each individual device."
  },
  {
    "id": "20,3",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "1",
    "detail": "Verify that memory protection controls such as ASLR and DEP are enabled by the IoT operating system, if applicable."
  },
  {
    "id": "20,4",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "1",
    "detail": "Verify that on-chip debugging interfaces such as JTAG or SWD are disabled or that available protection mechanism is enabled and configured appropriately."
  },
  {
    "id": "20,5",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "1",
    "detail": "Verify that physical debug headers are not present on the device."
  },
  {
    "id": "20,6",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "1",
    "detail": "Verify that sensitive data is not stored unencrypted on the device."
  },
  {
    "id": "20,7",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "1",
    "detail": "Verify that the device prevents leaking of sensitive information."
  },
  {
    "id": "20,8",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "1",
    "detail": "Verify that the firmware apps protect data-in-transit using transport security."
  },
  {
    "id": "20,9",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "1",
    "detail": "Verify that the firmware apps validate the digital signature of server connections."
  },
  {
    "id": "20,10",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "1",
    "detail": "Verify that wireless communications are mutually authenticated."
  },
  {
    "id": "20,11",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "1",
    "detail": "Verify that wireless communications are sent over an encrypted channel."
  },
  {
    "id": "20,12",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "2",
    "detail": "Verify that the firmware apps pin the digital signature to a trusted server(s)."
  },
  {
    "id": "20,13",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "2",
    "detail": "Verify the presence of physical tamper resistance and/or tamper detection features, including epoxy."
  },
  {
    "id": "20,14",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "2",
    "detail": "Verify that identifying markings on chips have been removed."
  },
  {
    "id": "20,15",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "2",
    "detail": "Verify that any available Intellectual Property protection technologies provided by the chip manufacturer are enabled."
  },
  {
    "id": "20,16",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "2",
    "detail": "Verify security controls are in place to hinder firmware reverse engineering (e.g., removal of verbose debugging strings)."
  },
  {
    "id": "20,17",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "2",
    "detail": "Verify the device validates the boot image signature before loading."
  },
  {
    "id": "20,18",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "2",
    "detail": "Verify that the firmware update process is not vulnerable to time-of-check vs time-of-use attacks."
  },
  {
    "id": "20,19",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "2",
    "detail": "Verify the device uses code signing and validates firmware upgrade files before installing."
  },
  {
    "id": "20,20",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "2",
    "detail": "Verify that the device cannot be downgraded to old versions of valid firmware."
  },
  {
    "id": "20,21",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "2",
    "detail": "Verify usage of cryptographically secure pseudo-random number generator on embedded device (e.g., using chip-provided random number generators)."
  },
  {
    "id": "20,22",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "3",
    "detail": "Verify that the device wipes firmware and sensitive data upon detection of tampering or receipt of invalid message."
  },
  {
    "id": "20,23",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "3",
    "detail": "Verify that only microcontrollers that support disabling debugging interfaces (e.g. JTAG, SWD) are used."
  },
  {
    "id": "20,24",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "3",
    "detail": "Verify that only microcontrollers that provide substantial protection from de-capping and side channel attacks are used."
  },
  {
    "id": "20,25",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "3",
    "detail": "Verify that sensitive traces are not exposed to outer layers of the printed circuit board."
  },
  {
    "id": "20,26",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "3",
    "detail": "Verify that inter-chip communication is encrypted."
  },
  {
    "id": "20,27",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "3",
    "detail": "Verify the device uses code signing and validates code before execution."
  },
  {
    "id": "20,28",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "3",
    "detail": "Verify that sensitive information maintained in memory is overwritten with zeros as soon as it is no longer required."
  },
  {
    "id": "20,29",
    "category": "INTERNET OF THINGS (IOT)",
    "level": "3",
    "detail": "Verify that the firmware apps utilize kernel containers for isolation between apps."
  }
]
