{
  "bomFormat": "CycloneDX",
  "specVersion": "1.6",
  "serialNumber": "urn:uuid:17e021df-35e4-4aee-a22b-3919fd43ab3f",
  "version": 1,
  "metadata": {
    "timestamp": "2025-10-19T11:10:02+00:00",
    "licenses": [
      {
        "license": {
          "id": "CC-BY-SA-4.0",
          "url": "https://creativecommons.org/licenses/by-sa/4.0/legalcode.txt"
        }
      }
    ],
    "supplier": {
      "name": "OWASP Foundation",
      "url": [
        "https://owasp.org"
      ]
    }
  },
  "declarations": {
    "standards": [
      {
        "bom-ref": "ASVS-5.0.0",
        "name": "Application Security Verification Standard (ASVS)",
        "version": "5.0.0",
        "description": "The OWASP Application Security Verification Standard (ASVS) Project provides a basis for testing web application technical security controls and also provides developers with a list of requirements for secure development.",
        "owner": "Application Security Verification Standard Project",
        "requirements": [
          {
            "bom-ref": "V1",
            "identifier": "V1",
            "title": "Encodage et nettoyage"
          },
          {
            "bom-ref": "V1.1",
            "identifier": "V1.1",
            "title": "Architecture d'encodage et de nettoyage",
            "parent": "V1"
          },
          {
            "bom-ref": "V1.1.1",
            "identifier": "V1.1.1",
            "text": "Vérifiez que l'entrée est décodée ou non échappée vers une forme canonique une seule fois, elle n'est décodée que lorsque des données codées sous cette forme sont attendues, et que cela est fait avant de traiter davantage l'entrée, par exemple, elle n'est pas effectuée après la validation ou la désinfection de l'entrée.",
            "parent": "V1.1"
          },
          {
            "bom-ref": "V1.1.2",
            "identifier": "V1.1.2",
            "text": "Vérifiez que l'application effectue l'encodage et l'échappement de sortie soit comme étape finale avant d'être utilisée par l'interpréteur pour lequel elle est destinée, soit par l'interpréteur lui-même.",
            "parent": "V1.1"
          },
          {
            "bom-ref": "V1.2",
            "identifier": "V1.2",
            "title": "Prévention des injections",
            "parent": "V1"
          },
          {
            "bom-ref": "V1.2.1",
            "identifier": "V1.2.1",
            "text": "Vérifiez que l'encodage de sortie d'une réponse HTTP, d'un document HTML ou d'un document XML est pertinent pour le contexte requis, comme l'encodage des caractères pertinents pour les éléments HTML, les attributs HTML, les commentaires HTML, les CSS ou les champs d'en-tête HTTP, pour éviter de modifier la structure du message ou du document.",
            "parent": "V1.2"
          },
          {
            "bom-ref": "V1.2.2",
            "identifier": "V1.2.2",
            "text": "Vérifiez que, lors de la création dynamique d'URL, les données non fiables sont encodées en fonction de leur contexte (par exemple, encodage d'URL ou encodage base64url pour les paramètres de requête ou de chemin). Assurez-vous que seuls les schémas d'URL sûrs sont autorisés (par exemple, interdire javascript: ou data:).",
            "parent": "V1.2"
          },
          {
            "bom-ref": "V1.2.3",
            "identifier": "V1.2.3",
            "text": "Vérifiez que l'encodage ou l'échappement de sortie est utilisé lors de la création dynamique de contenu JavaScript (y compris JSON), pour éviter de modifier la structure du message ou du document (pour éviter l'injection JavaScript et JSON).",
            "parent": "V1.2"
          },
          {
            "bom-ref": "V1.2.4",
            "identifier": "V1.2.4",
            "text": "Vérifiez que la sélection de données ou les requêtes de base de données (par exemple, SQL, HQL, NoSQL, Cypher) utilisent des requêtes paramétrées, des ORM, des Framework d'entités ou sont protégées contre les injections SQL et autres attaques par injection de base de données. Ceci est également pertinent lors de l'écriture de procédures stockées.",
            "parent": "V1.2"
          },
          {
            "bom-ref": "V1.2.5",
            "identifier": "V1.2.5",
            "text": "Vérifiez que l’application protège contre l’injection de commandes du système d’exploitation et que les appels du système d’exploitation utilisent des requêtes du système d’exploitation paramétrées ou utilisent un encodage de sortie de ligne de commande contextuelle.",
            "parent": "V1.2"
          },
          {
            "bom-ref": "V1.2.6",
            "identifier": "V1.2.6",
            "text": "Vérifiez que l’application protège contre les vulnérabilités d’injection LDAP ou que des contrôles de sécurité spécifiques pour empêcher l’injection LDAP ont été mis en œuvre.",
            "parent": "V1.2"
          },
          {
            "bom-ref": "V1.2.7",
            "identifier": "V1.2.7",
            "text": "Vérifiez que l’application est protégée contre les attaques par injection XPath en utilisant la paramétrisation des requêtes ou des requêtes précompilées.",
            "parent": "V1.2"
          },
          {
            "bom-ref": "V1.2.8",
            "identifier": "V1.2.8",
            "text": "Vérifiez que les processeurs LaTeX sont configurés de manière sécurisée (par exemple, en n'utilisant pas l'indicateur « --shell-escape ») et qu'une liste d’autorisations de commandes est utilisée pour empêcher les attaques par injection LaTeX.",
            "parent": "V1.2"
          },
          {
            "bom-ref": "V1.2.9",
            "identifier": "V1.2.9",
            "text": "Vérifiez que l'application échappe les caractères spéciaux dans les expressions régulières (généralement à l'aide d'une barre oblique inverse) pour éviter qu'ils ne soient mal interprétés comme des métacaractères.",
            "parent": "V1.2"
          },
          {
            "bom-ref": "V1.2.10",
            "identifier": "V1.2.10",
            "text": "Vérifiez que l'application est protégée contre les injections CSV et injections de formules. L'application doit respecter les règles d'échappement définies dans les sections 2.6 et 2.7 de la RFC 4180 lors de l'export de contenu CSV. De plus, lors de l'export au format CSV ou vers d'autres formats de tableur (tels que XLS, XLSX ou ODF), les caractères spéciaux (notamment « = », « + », « - », « @ », « \\t » (tabulation) et « \\0 » (caractère null)) doivent être protégés par une apostrophe s'ils apparaissent en premier dans une valeur de champ.",
            "parent": "V1.2"
          },
          {
            "bom-ref": "V1.3",
            "identifier": "V1.3",
            "title": "Nettoyage",
            "parent": "V1"
          },
          {
            "bom-ref": "V1.3.1",
            "identifier": "V1.3.1",
            "text": "Vérifiez que toutes les entrées HTML non fiables provenant d'éditeurs WYSIWYG ou similaires sont nettoyées à l'aide d'une bibliothèque ou d'une fonctionnalité de Framework de nettoyage HTML bien connue et sécurisée.",
            "parent": "V1.3"
          },
          {
            "bom-ref": "V1.3.2",
            "identifier": "V1.3.2",
            "text": "Vérifiez que l'application évite d'utiliser eval() ou d'autres fonctionnalités d'exécution de code dynamique telles que Spring Expression Language (SpEL). En l'absence d'alternative, toute saisie utilisateur incluse doit être nettoyée avant d'être exécutée.",
            "parent": "V1.3"
          },
          {
            "bom-ref": "V1.3.3",
            "identifier": "V1.3.3",
            "text": "Vérifiez que les données transmises à un contexte potentiellement dangereux sont préalablement nettoyées pour appliquer des mesures de sécurité, telles qu'autoriser uniquement des caractères sûrs pour ce contexte et raccourcir des entrées trop longues.",
            "parent": "V1.3"
          },
          {
            "bom-ref": "V1.3.4",
            "identifier": "V1.3.4",
            "text": "Vérifiez que le contenu Scalable Vector Graphics (SVG) scriptable fourni par l'utilisateur est validé ou nettoyé pour contenir uniquement des balises et des attributs (tels que des graphiques de dessin) qui sont sûrs pour l'application, par exemple, ne contiennent pas de scripts et d'objets étrangers.",
            "parent": "V1.3"
          },
          {
            "bom-ref": "V1.3.5",
            "identifier": "V1.3.5",
            "text": "Vérifiez que l'application nettoie ou désactive le contenu du langage de modèle d'expression ou de script fourni par l'utilisateur, tel que les feuilles de style CSS, le Markdown ou XSL, BBCode ou similaire.",
            "parent": "V1.3"
          },
          {
            "bom-ref": "V1.3.6",
            "identifier": "V1.3.6",
            "text": "Vérifiez que l'application protège contre les attaques de falsification de requête côté serveur (SSRF), en validant les données non fiables par rapport à une liste d'autorisation de protocoles, de domaines, de chemins et de ports et en nettoyant les caractères potentiellement dangereux avant d'utiliser les données pour appeler un autre service.",
            "parent": "V1.3"
          },
          {
            "bom-ref": "V1.3.7",
            "identifier": "V1.3.7",
            "text": "Vérifiez que l'application se protège contre les attaques par injection de modèles en interdisant la création de modèles basés sur des entrées non fiables. En l'absence d'alternative, toute entrée non fiable incluse dynamiquement lors de la création du modèle doit être nettoyée ou rigoureusement validée.",
            "parent": "V1.3"
          },
          {
            "bom-ref": "V1.3.8",
            "identifier": "V1.3.8",
            "text": "Vérifiez que l’application nettoie correctement les entrées non fiables avant utilisation dans les requêtes Java Naming and Directory Interface (JNDI) et que JNDI est configuré de manière sécurisée pour empêcher les attaques par injection JNDI.",
            "parent": "V1.3"
          },
          {
            "bom-ref": "V1.3.9",
            "identifier": "V1.3.9",
            "text": "Vérifiez que l’application nettoie le contenu avant qu’il ne soit envoyé à memcache pour éviter les attaques par injection.",
            "parent": "V1.3"
          },
          {
            "bom-ref": "V1.3.10",
            "identifier": "V1.3.10",
            "text": "Vérifiez que les chaînes de format susceptibles d'être résolues de manière inattendue ou malveillante lors de leur utilisation sont nettoyées avant d'être traitées.",
            "parent": "V1.3"
          },
          {
            "bom-ref": "V1.3.11",
            "identifier": "V1.3.11",
            "text": "Vérifiez que l'application nettoie les entrées utilisateur avant de les transmettre aux systèmes de messagerie pour se protéger contre l'injection SMTP ou IMAP.",
            "parent": "V1.3"
          },
          {
            "bom-ref": "V1.3.12",
            "identifier": "V1.3.12",
            "text": "Vérifiez que les expressions régulières sont exemptes d'éléments provoquant \"backtracking\" exponentiel et assurez-vous que les entrées non fiables sont nettoyées pour atténuer les attaques ReDoS ou Runaway Regex.",
            "parent": "V1.3"
          },
          {
            "bom-ref": "V1.4",
            "identifier": "V1.4",
            "title": "Mémoire, chaine de caractères et code à mémoire non-managée",
            "parent": "V1"
          },
          {
            "bom-ref": "V1.4.1",
            "identifier": "V1.4.1",
            "text": "Vérifiez que l'application utilise des chaînes memory-safe, une copie de mémoire et une arithmétique de pointeur renforcée pour détecter ou empêcher les débordements de pile, de tampon ou de tas.",
            "parent": "V1.4"
          },
          {
            "bom-ref": "V1.4.2",
            "identifier": "V1.4.2",
            "text": "Vérifiez que les techniques de validation du signe, de la plage et de l’entrée sont utilisées pour éviter les dépassements d’entiers.",
            "parent": "V1.4"
          },
          {
            "bom-ref": "V1.4.3",
            "identifier": "V1.4.3",
            "text": "Vérifiez que la mémoire et les ressources allouées dynamiquement sont libérées et que les références ou les pointeurs vers la mémoire libérée sont supprimés ou définis à null pour éviter les \"dangling pointer\" et les vulnérabilités d'utilisation après libération.",
            "parent": "V1.4"
          },
          {
            "bom-ref": "V1.5",
            "identifier": "V1.5",
            "title": "Désérialisation sécurisée",
            "parent": "V1"
          },
          {
            "bom-ref": "V1.5.1",
            "identifier": "V1.5.1",
            "text": "Vérifiez que l'application configure les \"parser\" XML pour utiliser une configuration restrictive et que les fonctionnalités non sûres telles que la résolution d'entités externes sont désactivées pour empêcher les attaques XML eXternal Entity (XXE).",
            "parent": "V1.5"
          },
          {
            "bom-ref": "V1.5.2",
            "identifier": "V1.5.2",
            "text": "Vérifiez que la désérialisation des données non fiables garantit une gestion sécurisée des entrées, par exemple en utilisant une liste d'autorisation de types d'objets ou en limitant les types d'objets définis par le client, afin d'empêcher les attaques par désérialisation. Les mécanismes de désérialisation explicitement définis comme non sécurisés ne doivent pas être utilisés avec des entrées non fiables.",
            "parent": "V1.5"
          },
          {
            "bom-ref": "V1.5.3",
            "identifier": "V1.5.3",
            "text": "Vérifiez que les différents \"parser\" utilisés dans l'application pour le même type de données (par exemple, les \"parser\" JSON, les \"parser\" XML, les \"parser\" d'URL) effectuent l'analyse de manière cohérente et utilisent le même mécanisme d'encodage de caractères pour éviter des problèmes tels que les vulnérabilités d'interopérabilité JSON ou un comportement d'analyse d'URI ou de fichier différent exploité dans les attaques d'inclusion de fichiers à distance (RFI) ou de falsification de requête côté serveur (SSRF).",
            "parent": "V1.5"
          },
          {
            "bom-ref": "V2",
            "identifier": "V2",
            "title": "Validation et logique métier"
          },
          {
            "bom-ref": "V2.1",
            "identifier": "V2.1",
            "title": "Validation et documentation de la logique métier",
            "parent": "V2"
          },
          {
            "bom-ref": "V2.1.1",
            "identifier": "V2.1.1",
            "text": "Vérifiez que la documentation de l'application définit des règles de validation des entrées pour vérifier la validité des éléments de données par rapport à la structure attendue. Il peut s'agir de formats de données courants tels que des numéros de carte de crédit, des adresses e-mail ou des numéros de téléphone, ou d'un format de données interne.",
            "parent": "V2.1"
          },
          {
            "bom-ref": "V2.1.2",
            "identifier": "V2.1.2",
            "text": "Vérifiez que la documentation de l'application définit comment valider la cohérence logique et contextuelle des éléments de données combinés, par exemple en vérifiant que la banlieue et le code postal correspondent.",
            "parent": "V2.1"
          },
          {
            "bom-ref": "V2.1.3",
            "identifier": "V2.1.3",
            "text": "Vérifiez que les attentes en matière de limites et de validations de la logique métier sont documentées, y compris par utilisateur et globalement dans l'application.",
            "parent": "V2.1"
          },
          {
            "bom-ref": "V2.2",
            "identifier": "V2.2",
            "title": "Validation des entrées",
            "parent": "V2"
          },
          {
            "bom-ref": "V2.2.1",
            "identifier": "V2.2.1",
            "text": "Vérifier que les entrées sont validées afin de respecter les attentes métier ou fonctionnelles. Cette validation doit être basée sur une liste de valeurs, de modèles et de plages autorisées, ou sur la comparaison des entrées avec une structure attendue et des limites logiques selon des règles prédéfinies. Pour le niveau 1, cette validation peut se concentrer sur les entrées utilisées pour prendre des décisions métier ou de sécurité spécifiques. À partir du niveau 2, elle doit s'appliquer à toutes les entrées.",
            "parent": "V2.2"
          },
          {
            "bom-ref": "V2.2.2",
            "identifier": "V2.2.2",
            "text": "Vérifiez que l'application est conçue pour appliquer la validation des entrées au niveau d'une couche de service de confiance. Bien que la validation côté client améliore l'ergonomie et doit être encouragée, elle ne doit pas être considérée comme un contrôle de sécurité.",
            "parent": "V2.2"
          },
          {
            "bom-ref": "V2.2.3",
            "identifier": "V2.2.3",
            "text": "Vérifiez que l’application garantit que les combinaisons d’éléments de données associés sont raisonnables selon les règles prédéfinies.",
            "parent": "V2.2"
          },
          {
            "bom-ref": "V2.3",
            "identifier": "V2.3",
            "title": "Sécurité de la logique métier",
            "parent": "V2"
          },
          {
            "bom-ref": "V2.3.1",
            "identifier": "V2.3.1",
            "text": "Vérifiez que l’application traitera uniquement les flux de logique métier pour le même utilisateur dans l’ordre séquentiel attendu et sans sauter d’étapes.",
            "parent": "V2.3"
          },
          {
            "bom-ref": "V2.3.2",
            "identifier": "V2.3.2",
            "text": "Vérifiez que les limites de la logique métier sont implémentées conformément à la documentation de l'application, afin d'éviter que des failles de la logique métier ne soient pas exploitées.",
            "parent": "V2.3"
          },
          {
            "bom-ref": "V2.3.3",
            "identifier": "V2.3.3",
            "text": "Vérifiez que les transactions sont utilisées au niveau de la logique métier de telle sorte qu'une opération de logique métier réussisse dans son intégralité ou qu'elle soit restaurée à l'état correct précédent.",
            "parent": "V2.3"
          },
          {
            "bom-ref": "V2.3.4",
            "identifier": "V2.3.4",
            "text": "Vérifiez que les mécanismes de verrouillage au niveau de la logique métier sont utilisés pour garantir que les ressources en quantité limitée (telles que les sièges de théâtre ou les créneaux de livraison) ne peuvent pas être réservées deux fois en manipulant la logique de l'application.",
            "parent": "V2.3"
          },
          {
            "bom-ref": "V2.3.5",
            "identifier": "V2.3.5",
            "text": "Vérifiez que les flux logiques métier à forte valeur ajoutée nécessitent l'approbation de plusieurs utilisateurs afin d'éviter toute action non autorisée ou accidentelle. Cela peut inclure, sans s'y limiter, les transferts monétaires importants, les approbations de contrats, l'accès à des informations classifiées ou les contournements de sécurité dans le secteur manufacturier.",
            "parent": "V2.3"
          },
          {
            "bom-ref": "V2.4",
            "identifier": "V2.4",
            "title": "Anti-automatisation",
            "parent": "V2"
          },
          {
            "bom-ref": "V2.4.1",
            "identifier": "V2.4.1",
            "text": "Vérifiez que des contrôles anti-automatisation sont en place pour protéger contre les appels excessifs aux fonctions d'application qui pourraient conduire à l'exfiltration de données, à la création de données inutiles, à l'épuisement des quotas, aux violations de limites de débit, au déni de service ou à la surutilisation de ressources coûteuses.",
            "parent": "V2.4"
          },
          {
            "bom-ref": "V2.4.2",
            "identifier": "V2.4.2",
            "text": "Vérifiez que les flux logiques métier nécessitent un timing humain réaliste, évitant ainsi des soumissions de transactions excessivement rapides.",
            "parent": "V2.4"
          },
          {
            "bom-ref": "V3",
            "identifier": "V3",
            "title": "Sécurité du frontend Web"
          },
          {
            "bom-ref": "V3.1",
            "identifier": "V3.1",
            "title": "Documentation sur la sécurité du frontend Web",
            "parent": "V3"
          },
          {
            "bom-ref": "V3.1.1",
            "identifier": "V3.1.1",
            "text": "Vérifiez que la documentation de l'application indique les fonctionnalités de sécurité attendues que les navigateurs utilisant l'application doivent prendre en charge (telles que HTTPS, HTTP Strict Transport Security (HSTS), Content Security Policy (CSP) et autres mécanismes de sécurité HTTP pertinents). Elle doit également définir le comportement de l'application lorsque certaines de ces fonctionnalités ne sont pas disponibles (par exemple, avertir l'utilisateur ou bloquer l'accès).",
            "parent": "V3.1"
          },
          {
            "bom-ref": "V3.2",
            "identifier": "V3.2",
            "title": "Interprétation non intentionnelle du contenu",
            "parent": "V3"
          },
          {
            "bom-ref": "V3.2.1",
            "identifier": "V3.2.1",
            "text": "Vérifiez que des contrôles de sécurité sont en place pour empêcher les navigateurs d'afficher du contenu ou des fonctionnalités dans les réponses HTTP dans un contexte incorrect (par exemple, lorsqu'une API, un fichier téléchargé par l'utilisateur ou une autre ressource est demandée directement). Les contrôles possibles peuvent inclure : ne pas transmettre le contenu sauf si les champs d'en-tête de requête HTTP (tels que Sec-Fetch-\\*) indiquent qu'il s'agit du contexte correct, utiliser la directive sandbox du champ d'en-tête Content-Security-Policy ou utiliser le type de disposition de pièce jointe dans le champ d'en-tête Content-Disposition.",
            "parent": "V3.2"
          },
          {
            "bom-ref": "V3.2.2",
            "identifier": "V3.2.2",
            "text": "Vérifiez que le contenu destiné à être affiché sous forme de texte, plutôt que rendu sous forme de HTML, est géré à l'aide de fonctions de rendu sécurisées (telles que createTextNode ou textContent) pour empêcher l'exécution involontaire de contenu tel que HTML ou JavaScript.",
            "parent": "V3.2"
          },
          {
            "bom-ref": "V3.2.3",
            "identifier": "V3.2.3",
            "text": "Vérifiez que l'application évite l'écrasement du DOM lors de l'utilisation de JavaScript côté client en utilisant des déclarations de variables explicites, en effectuant une vérification de type stricte, en évitant de stocker des variables globales sur l'objet document et en implémentant l'isolation de l'espace de nommage.",
            "parent": "V3.2"
          },
          {
            "bom-ref": "V3.3",
            "identifier": "V3.3",
            "title": "Configuration des cookies",
            "parent": "V3"
          },
          {
            "bom-ref": "V3.3.1",
            "identifier": "V3.3.1",
            "text": "Vérifiez que les cookies ont l'attribut « Secure » ​​défini et si le préfixe « \\__Host- » n'est pas utilisé pour le nom du cookie, le préfixe « __Secure- » doit être utilisé pour le nom du cookie.",
            "parent": "V3.3"
          },
          {
            "bom-ref": "V3.3.2",
            "identifier": "V3.3.2",
            "text": "Vérifiez que la valeur de l'attribut « SameSite » de chaque cookie est définie en fonction de l'objectif du cookie, afin de limiter l'exposition aux attaques de réparation de l'interface utilisateur et aux attaques de falsification de requêtes basées sur le navigateur, communément appelées falsification de requêtes intersites (CSRF).",
            "parent": "V3.3"
          },
          {
            "bom-ref": "V3.3.3",
            "identifier": "V3.3.3",
            "text": "Vérifiez que les cookies ont le préfixe « __Host- » pour le nom du cookie, sauf s'ils sont explicitement conçus pour être partagés avec d'autres hôtes.",
            "parent": "V3.3"
          },
          {
            "bom-ref": "V3.3.4",
            "identifier": "V3.3.4",
            "text": "Vérifiez que si la valeur d'un cookie n'est pas censée être accessible aux scripts côté client (comme un jeton de session), le cookie doit avoir l'attribut « HttpOnly » défini et la même valeur (par exemple, un jeton de session) ne doit être transférée au client que via le champ d'en-tête « Set-Cookie ».",
            "parent": "V3.3"
          },
          {
            "bom-ref": "V3.3.5",
            "identifier": "V3.3.5",
            "text": "Vérifiez que lorsque l'application écrit un cookie, la longueur combinée du nom et de la valeur du cookie ne dépasse pas 4 096 octets. Les cookies trop volumineux ne seront pas stockés par le navigateur et ne seront donc pas envoyés avec les requêtes, empêchant ainsi l'utilisateur d'utiliser les fonctionnalités de l'application qui reposent sur ce cookie.",
            "parent": "V3.3"
          },
          {
            "bom-ref": "V3.4",
            "identifier": "V3.4",
            "title": "En-têtes du mécanisme de sécurité du navigateur",
            "parent": "V3"
          },
          {
            "bom-ref": "V3.4.1",
            "identifier": "V3.4.1",
            "text": "Vérifiez qu'un champ d'en-tête Strict-Transport-Security est inclus dans toutes les réponses afin d'appliquer une politique HTTP Strict Transport Security (HSTS). Une durée maximale d'au moins un an doit être définie, et pour les niveaux L2 et supérieurs, la politique doit également s'appliquer à tous les sous-domaines.",
            "parent": "V3.4"
          },
          {
            "bom-ref": "V3.4.2",
            "identifier": "V3.4.2",
            "text": "Vérifiez que le champ d'en-tête Access-Control-Allow-Origin du partage de ressources cross-origine (CORS) est une valeur fixe de l'application ou, si la valeur du champ d'en-tête de requête HTTP Origin est utilisée, qu'elle est validée par rapport à une liste d'origines approuvées. Si « Access-Control-Allow-Origin: * » doit être utilisé, vérifiez que la réponse ne contient aucune information sensible.",
            "parent": "V3.4"
          },
          {
            "bom-ref": "V3.4.3",
            "identifier": "V3.4.3",
            "text": "Vérifiez que les réponses HTTP incluent un champ d'en-tête de réponse Content-Security-Policy qui définit des directives garantissant que le navigateur charge et exécute uniquement du contenu ou des ressources fiables, afin de limiter l'exécution de JavaScript malveillant. Au minimum, une politique globale doit être utilisée, incluant les directives object-src 'none' et base-uri 'none', et définissant soit une lliste d’autorisations, soit des valeurs nonces ou des hachages. Pour une application L3, une politique par réponse avec des valeurs nonces ou des hachages doit être définie.",
            "parent": "V3.4"
          },
          {
            "bom-ref": "V3.4.4",
            "identifier": "V3.4.4",
            "text": "Vérifiez que toutes les réponses HTTP contiennent un champ d'en-tête « X-Content-Type-Options: nosniff ». Cela indique aux navigateurs de ne pas utiliser l'analyse de contenu ni la détection du type MIME pour la réponse donnée, et d'exiger que la valeur du champ d'en-tête « Content-Type » de la réponse corresponde à la ressource de destination. Par exemple, la réponse à une demande de style n'est acceptée que si le type de contenu de la réponse est « text/css ». Cela permet également au navigateur d'utiliser la fonctionnalité de blocage de lecture inter-origines (CORB).",
            "parent": "V3.4"
          },
          {
            "bom-ref": "V3.4.5",
            "identifier": "V3.4.5",
            "text": "Vérifiez que l'application définit une politique de référencement afin d'empêcher la fuite de données techniquement sensibles vers des services tiers via le champ d'en-tête de requête HTTP « Referer ». Cela peut être effectué via le champ d'en-tête de réponse HTTP « Referrer-Policy » ou via les attributs d'élément HTML. Les données sensibles peuvent inclure le chemin d'accès et les données de requête dans l'URL, et pour les applications internes non publiques, le nom d'hôte.",
            "parent": "V3.4"
          },
          {
            "bom-ref": "V3.4.6",
            "identifier": "V3.4.6",
            "text": "Vérifiez que l'application Web utilise la directive frame-ancestors du champ d'en-tête Content-Security-Policy pour chaque réponse HTTP afin de garantir qu'elle ne peut pas être intégrée par défaut et que l'intégration de ressources spécifiques n'est autorisée qu'en cas de nécessité. Notez que le champ d'en-tête X-Frame-Options, bien que pris en charge par les navigateurs, est obsolète et n'est pas forcément fiable.",
            "parent": "V3.4"
          },
          {
            "bom-ref": "V3.4.7",
            "identifier": "V3.4.7",
            "text": "Vérifiez que le champ d’en-tête Content-Security-Policy spécifie un emplacement pour signaler les violations.",
            "parent": "V3.4"
          },
          {
            "bom-ref": "V3.4.8",
            "identifier": "V3.4.8",
            "text": "Vérifiez que toutes les réponses HTTP qui lancent le rendu d'un document (comme les réponses de type text/html) incluent le champ d'en-tête 'Cross-Origin-Opener-Policy' avec la directive 'same-origin' ou s'ame-origin-allow-popups', selon les besoins. Cela empêche les attaques abusant de l'accès partagé aux objets Window, telles que le tabnabbing et le comptage d'images.",
            "parent": "V3.4"
          },
          {
            "bom-ref": "V3.5",
            "identifier": "V3.5",
            "title": "Séparation de l'origine du navigateur",
            "parent": "V3"
          },
          {
            "bom-ref": "V3.5.1",
            "identifier": "V3.5.1",
            "text": "Vérifiez que, si l'application ne s'appuie pas sur le mécanisme de requête de pré-vérification cross-origin CORS pour empêcher les requêtes inter-origines non autorisées d'utiliser des fonctionnalités sensibles, ces requêtes sont validées afin de garantir leur origine. Cela peut se faire en utilisant et en validant des jetons anti-falsification ou en exigeant des champs d'en-tête HTTP supplémentaires qui ne sont pas des champs d'en-tête de requête CORS safelist. Ceci permet de se protéger contre les attaques de falsification de requêtes basées sur le navigateur, communément appelées falsification de requêtes intersites (CSRF).",
            "parent": "V3.5"
          },
          {
            "bom-ref": "V3.5.2",
            "identifier": "V3.5.2",
            "text": "Vérifiez que, si l'application s'appuie sur le mécanisme de requête de pré-vérification cross-origin CORS pour empêcher l'utilisation inter-origines non autorisée de fonctionnalités sensibles, il est impossible d'appeler la fonctionnalité avec une requête qui ne déclenche pas de requête de pré-vérification cross-origin CORS. Cela peut nécessiter de vérifier les valeurs des champs d'en-tête de requête 'Origin' et 'Content-Type' ou d'utiliser un champ d'en-tête supplémentaire qui n'est pas un champ d'en-tête de la liste de sécurité CORS.",
            "parent": "V3.5"
          },
          {
            "bom-ref": "V3.5.3",
            "identifier": "V3.5.3",
            "text": "Vérifiez que les requêtes HTTP destinées aux fonctionnalités sensibles utilisent des méthodes HTTP appropriées, telles que POST, PUT, PATCH ou DELETE, et non des méthodes définies comme « sûres » par la spécification HTTP, telles que HEAD, OPTIONS ou GET. Une validation stricte des champs d'en-tête de requête Sec-Fetch-* peut également être utilisée pour garantir que la requête ne provient pas d'un appel inter-origines inapproprié, d'une requête de navigation ou d'un chargement de ressources (comme une source d'image) inattendu.",
            "parent": "V3.5"
          },
          {
            "bom-ref": "V3.5.4",
            "identifier": "V3.5.4",
            "text": "Vérifiez que des applications distinctes sont hébergées sur des noms d'hôte différents pour tirer parti des restrictions fournies par la politique de même origine, y compris la manière dont les documents ou scripts chargés par une origine peuvent interagir avec les ressources d'une autre origine et les restrictions basées sur le nom d'hôte sur les cookies.",
            "parent": "V3.5"
          },
          {
            "bom-ref": "V3.5.5",
            "identifier": "V3.5.5",
            "text": "Vérifiez que les messages reçus par l'interface postMessage sont rejetés si l'origine du message n'est pas digne de confiance ou si la syntaxe du message n'est pas valide.",
            "parent": "V3.5"
          },
          {
            "bom-ref": "V3.5.6",
            "identifier": "V3.5.6",
            "text": "Vérifiez que la fonctionnalité JSONP n'est activée nulle part dans l'application pour éviter les attaques Cross-Site Script Inclusion (XSSI).",
            "parent": "V3.5"
          },
          {
            "bom-ref": "V3.5.7",
            "identifier": "V3.5.7",
            "text": "Vérifiez que les données nécessitant une autorisation ne sont pas incluses dans les réponses des ressources de script, comme les fichiers JavaScript, pour empêcher les attaques par inclusion de script intersite (XSSI).",
            "parent": "V3.5"
          },
          {
            "bom-ref": "V3.5.8",
            "identifier": "V3.5.8",
            "text": "Vérifiez que les ressources authentifiées (telles que les images, les vidéos, les scripts et autres documents) peuvent être chargées ou intégrées pour le compte de l'utilisateur uniquement lorsque cela est prévu. Cela peut être réalisé en validant strictement les champs d'en-tête de requête HTTP Sec-Fetch-* afin de garantir que la requête ne provient pas d'un appel cross-origin inapproprié, ou en définissant un champ d'en-tête de réponse HTTP Cross-Origin-Resource-Policy restrictif pour indiquer au navigateur de bloquer le contenu renvoyé.",
            "parent": "V3.5"
          },
          {
            "bom-ref": "V3.6",
            "identifier": "V3.6",
            "title": "Intégrité des ressources externes",
            "parent": "V3"
          },
          {
            "bom-ref": "V3.6.1",
            "identifier": "V3.6.1",
            "text": "Vérifiez que les ressources côté client, telles que les bibliothèques JavaScript, les feuilles de style CSS ou les polices web, sont hébergées en externe (par exemple, sur un réseau de diffusion de contenu) uniquement si la ressource est statique et versionnée, et si l'intégrité des sous-ressources (SRI) est utilisée pour valider l'intégrité de la ressource. Si cela n'est pas possible, une décision de sécurité documentée doit justifier cette décision pour chaque ressource.",
            "parent": "V3.6"
          },
          {
            "bom-ref": "V3.7",
            "identifier": "V3.7",
            "title": "Autres considérations sur la sécurité du navigateur",
            "parent": "V3"
          },
          {
            "bom-ref": "V3.7.1",
            "identifier": "V3.7.1",
            "text": "Vérifiez que l'application utilise uniquement des technologies côté client toujours prises en charge et considérées comme sécurisées. Parmi les technologies qui ne répondent pas à cette exigence figurent les plugins NSAPI, Flash, Shockwave, ActiveX, Silverlight, NACL ou les applets Java côté client.",
            "parent": "V3.7"
          },
          {
            "bom-ref": "V3.7.2",
            "identifier": "V3.7.2",
            "text": "Vérifiez que l'application redirigera automatiquement l'utilisateur vers un nom d'hôte ou un domaine différent (qui n'est pas contrôlé par l'application) uniquement lorsque la destination apparaît sur une liste d'autorisation.",
            "parent": "V3.7"
          },
          {
            "bom-ref": "V3.7.3",
            "identifier": "V3.7.3",
            "text": "Vérifiez que le domaine de premier niveau de l'application (par exemple, site.tld) ​​est ajouté à la liste de préchargement publique pour HTTP Strict Transport Security (HSTS). Cela garantit que l'utilisation de TLS pour l'application est intégrée directement dans les principaux navigateurs, plutôt que de dépendre uniquement du champ d'en-tête de réponse Strict-Transport-Security.",
            "parent": "V3.7"
          },
          {
            "bom-ref": "V3.7.4",
            "identifier": "V3.7.4",
            "text": "Vérifiez que l'application affiche une notification lorsque l'utilisateur est redirigé vers une URL hors du contrôle de l'application, avec une option pour annuler la navigation.",
            "parent": "V3.7"
          },
          {
            "bom-ref": "V3.7.5",
            "identifier": "V3.7.5",
            "text": "Vérifiez que l'application se comporte comme documenté (par exemple, en avertissant l'utilisateur ou en bloquant l'accès) si le navigateur utilisé pour accéder à l'application ne prend pas en charge les fonctionnalités de sécurité attendues.",
            "parent": "V3.7"
          },
          {
            "bom-ref": "V4",
            "identifier": "V4",
            "title": "API et service Web"
          },
          {
            "bom-ref": "V4.1",
            "identifier": "V4.1",
            "title": "Sécurité du service Web générique",
            "parent": "V4"
          },
          {
            "bom-ref": "V4.1.1",
            "identifier": "V4.1.1",
            "text": "Vérifiez que chaque réponse HTTP avec un corps de message contient un champ d'en-tête Content-Type qui correspond au contenu réel de la réponse, y compris le paramètre charset pour spécifier un codage de caractères sécurisé (par exemple, UTF-8, ISO-8859-1) conformément aux types de médias IANA, tels que « text/ », « /+xml » et « /xml ».",
            "parent": "V4.1"
          },
          {
            "bom-ref": "V4.1.2",
            "identifier": "V4.1.2",
            "text": "Vérifiez que seuls les terminaux utilisateurs (destinés à l'accès manuel via un navigateur web) redirigent automatiquement de HTTP vers HTTPS, tandis que les autres services ou terminaux n'implémentent pas de redirections transparentes. Cela permet d'éviter qu'un client envoie par erreur des requêtes HTTP non chiffrées, mais que, comme ces requêtes sont automatiquement redirigées vers HTTPS, la fuite de données sensibles passe inaperçue.",
            "parent": "V4.1"
          },
          {
            "bom-ref": "V4.1.3",
            "identifier": "V4.1.3",
            "text": "Vérifiez que tout champ d'en-tête HTTP utilisé par l'application et défini par une couche intermédiaire, telle qu'un équilibreur de charge, un proxy web ou un service backend-for-frontend, ne peut pas être remplacé par l'utilisateur final. Les exemples d'en-têtes peuvent inclure X-Real-IP, X-Forwarded-*, ou X-User-ID.",
            "parent": "V4.1"
          },
          {
            "bom-ref": "V4.1.4",
            "identifier": "V4.1.4",
            "text": "Vérifiez que seules les méthodes HTTP explicitement prises en charge par l'application ou son API (y compris les OPTIONS lors des demandes de contrôle en amont) peuvent être utilisées et que les méthodes inutilisées sont bloquées.",
            "parent": "V4.1"
          },
          {
            "bom-ref": "V4.1.5",
            "identifier": "V4.1.5",
            "text": "Vérifier que les signatures numériques par message sont utilisées pour fournir une assurance supplémentaire en plus des protections de transport pour les demandes ou les transactions qui sont très sensibles ou qui traversent un certain nombre de systèmes.",
            "parent": "V4.1"
          },
          {
            "bom-ref": "V4.2",
            "identifier": "V4.2",
            "title": "Validation de la structure des messages HTTP",
            "parent": "V4"
          },
          {
            "bom-ref": "V4.2.1",
            "identifier": "V4.2.1",
            "text": "Vérifiez que tous les composants de l'application (y compris les équilibreurs de charge, les pares-feux et les serveurs d'applications) déterminent les limites des messages HTTP entrants à l'aide du mécanisme approprié à la version HTTP afin d'empêcher la contrebande de requêtes HTTP. Dans HTTP/1.x, si un champ d'en-tête Transfer-Encoding est présent, l'en-tête Content-Length doit être ignoré conformément à la RFC 2616. Avec HTTP/2 ou HTTP/3, si un champ d'en-tête Content-Length est présent, le récepteur doit s'assurer qu'il est cohérent avec la longueur des trames DATA.",
            "parent": "V4.2"
          },
          {
            "bom-ref": "V4.2.2",
            "identifier": "V4.2.2",
            "text": "Vérifier que, lors de la génération de messages HTTP, le champ d'en-tête Content-Length n'entre pas en conflit avec la longueur du contenu déterminée par le cadrage du protocole HTTP, afin d'empêcher les attaques de type « request smuggling ».",
            "parent": "V4.2"
          },
          {
            "bom-ref": "V4.2.3",
            "identifier": "V4.2.3",
            "text": "Vérifiez que l'application n'envoie ni n'accepte de messages HTTP/2 ou HTTP/3 avec des champs d'en-tête spécifiques à la connexion, tels que Transfer-Encoding, afin d'éviter les attaques par fractionnement de la réponse et par injection d'en-tête.",
            "parent": "V4.2"
          },
          {
            "bom-ref": "V4.2.4",
            "identifier": "V4.2.4",
            "text": "Vérifiez que l'application n'accepte que les requêtes HTTP/2 et HTTP/3 dont les champs et valeurs d'en-tête ne contiennent pas de séquences CR (\\r), LF (\\n) ou CRLF (\\r\\n), afin d'éviter les attaques par injection d'en-tête.",
            "parent": "V4.2"
          },
          {
            "bom-ref": "V4.2.5",
            "identifier": "V4.2.5",
            "text": "Vérifiez que, si l'application (backend ou frontend) construit et envoie des requêtes, elle utilise des mécanismes de validation, d'assainissement ou autres pour éviter de créer des URI (comme pour les appels API) ou des champs d'en-tête de requête HTTP (comme Authorization ou Cookie) qui sont trop longs pour être acceptés par le composant récepteur. Cela pourrait entraîner un déni de service, par exemple lors de l'envoi d'une requête trop longue (par exemple, un long champ d'en-tête de cookie), ce qui fait que le serveur répond toujours avec un statut d'erreur.",
            "parent": "V4.2"
          },
          {
            "bom-ref": "V4.3",
            "identifier": "V4.3",
            "title": "GraphQL",
            "parent": "V4"
          },
          {
            "bom-ref": "V4.3.1",
            "identifier": "V4.3.1",
            "text": "Vérifiez qu'une liste d'autorisation de requête, une limitation de profondeur, une limitation de quantité ou une analyse des coûts de requête est utilisée pour empêcher le déni de service (DoS) de GraphQL ou d'expression de la couche données en raison de requêtes imbriquées coûteuses.",
            "parent": "V4.3"
          },
          {
            "bom-ref": "V4.3.2",
            "identifier": "V4.3.2",
            "text": "Vérifiez que les requêtes d’introspection GraphQL sont désactivées dans l’environnement de production, sauf si l’API GraphQL est destinée à être utilisée par d’autres parties.",
            "parent": "V4.3"
          },
          {
            "bom-ref": "V4.4",
            "identifier": "V4.4",
            "title": "WebSocket",
            "parent": "V4"
          },
          {
            "bom-ref": "V4.4.1",
            "identifier": "V4.4.1",
            "text": "Vérifiez que WebSocket sur TLS (WSS) est utilisé pour toutes les connexions WebSocket.",
            "parent": "V4.4"
          },
          {
            "bom-ref": "V4.4.2",
            "identifier": "V4.4.2",
            "text": "Vérifiez que, lors de la négociation HTTP WebSocket initiale, le champ d’en-tête 'Origin' est vérifié par rapport à une liste d’origines autorisées pour l’application.",
            "parent": "V4.4"
          },
          {
            "bom-ref": "V4.4.3",
            "identifier": "V4.4.3",
            "text": "Vérifiez que, si la gestion de session standard de l'application ne peut pas être utilisée, des jetons dédiés sont utilisés à cet effet, qui sont conformes aux exigences de sécurité de gestion de session pertinentes.",
            "parent": "V4.4"
          },
          {
            "bom-ref": "V4.4.4",
            "identifier": "V4.4.4",
            "text": "Vérifiez que les jetons de gestion de session WebSocket dédiés sont initialement obtenus ou validés via la session HTTPS précédemment authentifiée lors de la transition d'une session HTTPS existante vers un canal WebSocket.",
            "parent": "V4.4"
          },
          {
            "bom-ref": "V5",
            "identifier": "V5",
            "title": "Gestion des fichiers"
          },
          {
            "bom-ref": "V5.1",
            "identifier": "V5.1",
            "title": "Documentation sur la gestion des fichiers",
            "parent": "V5"
          },
          {
            "bom-ref": "V5.1.1",
            "identifier": "V5.1.1",
            "text": "Vérifiez que la documentation définit les types de fichiers autorisés, les extensions de fichiers attendues et la taille maximale (y compris la taille décompressée) pour chaque fonctionnalité de Téléversement. De plus, assurez-vous que la documentation précise comment les fichiers sont sécurisés pour le téléchargement et le traitement des utilisateurs finaux, par exemple le comportement de l'application lorsqu'un fichier malveillant est détecté.",
            "parent": "V5.1"
          },
          {
            "bom-ref": "V5.2",
            "identifier": "V5.2",
            "title": "Téléversement de fichiers et contenu",
            "parent": "V5"
          },
          {
            "bom-ref": "V5.2.1",
            "identifier": "V5.2.1",
            "text": "Vérifiez que l'application n'acceptera que des fichiers d'une taille qu'elle peut traiter sans provoquer de perte de performances ou d'attaque par déni de service.",
            "parent": "V5.2"
          },
          {
            "bom-ref": "V5.2.2",
            "identifier": "V5.2.2",
            "text": "Vérifiez que lorsque l'application accepte un fichier, seul ou dans une archive telle qu'un fichier zip, elle vérifie si l'extension de fichier correspond à une extension attendue et que le contenu correspond au type représenté par l'extension. Cela inclut, sans s'y limiter, la vérification des « octets magiques » initiaux, la réécriture d'images et l'utilisation de bibliothèques spécialisées pour la validation du contenu des fichiers. Pour le niveau L1, cela peut se concentrer uniquement sur les fichiers utilisés pour prendre des décisions métier ou de sécurité spécifiques. À partir du niveau L2, cela doit s'appliquer à tous les fichiers acceptés.",
            "parent": "V5.2"
          },
          {
            "bom-ref": "V5.2.3",
            "identifier": "V5.2.3",
            "text": "Vérifiez que l'application vérifie les fichiers compressés (par exemple, zip, gz, docx, odt) par rapport à la taille maximale autorisée non compressée et au nombre maximal de fichiers avant de décompresser le fichier.",
            "parent": "V5.2"
          },
          {
            "bom-ref": "V5.2.4",
            "identifier": "V5.2.4",
            "text": "Vérifiez qu'un quota de taille de fichier et un nombre maximal de fichiers par utilisateur sont appliqués pour garantir qu'un seul utilisateur ne puisse pas remplir le stockage avec trop de fichiers ou des fichiers excessivement volumineux.",
            "parent": "V5.2"
          },
          {
            "bom-ref": "V5.2.5",
            "identifier": "V5.2.5",
            "text": "Vérifiez que l'application n'autorise pas le téléversement de fichiers compressés contenant des liens symboliques, sauf si cela est spécifiquement requis (auquel cas il sera nécessaire d'appliquer une liste d'autorisation des fichiers vers lesquels il est possible de créer des liens symboliques).",
            "parent": "V5.2"
          },
          {
            "bom-ref": "V5.2.6",
            "identifier": "V5.2.6",
            "text": "Vérifiez que l'application rejette les images téléversées avec une taille de pixel supérieure au maximum autorisé, afin d'éviter les attaques par inondation de pixels.",
            "parent": "V5.2"
          },
          {
            "bom-ref": "V5.3",
            "identifier": "V5.3",
            "title": "Stockage de fichiers",
            "parent": "V5"
          },
          {
            "bom-ref": "V5.3.1",
            "identifier": "V5.3.1",
            "text": "Vérifiez que les fichiers téléversés ou générés par une entrée non fiable et stockés dans un dossier public ne sont pas exécutés en tant que code de programme côté serveur lorsqu'ils sont accessibles directement avec une requête HTTP.",
            "parent": "V5.3"
          },
          {
            "bom-ref": "V5.3.2",
            "identifier": "V5.3.2",
            "text": "Vérifiez que lorsque l'application crée des chemins d'accès pour les opérations sur les fichiers, elle utilise des données générées en interne ou fiables plutôt que des noms de fichiers soumis par l'utilisateur. Si des noms de fichiers ou des métadonnées de fichiers soumis par l'utilisateur doivent être utilisés, une validation et un nettoyage stricts doivent être appliqués. Ceci permet de se protéger contre les attaques par traversée de chemin, l'inclusion de fichiers locaux ou distants (LFI, RFI) et la falsification de requêtes côté serveur (SSRF).",
            "parent": "V5.3"
          },
          {
            "bom-ref": "V5.3.3",
            "identifier": "V5.3.3",
            "text": "Vérifiez que le traitement des fichiers côté serveur, comme la décompression des fichiers, ignore les informations de chemin fournies par l'utilisateur pour éviter les vulnérabilités telles que le \"zip slip\".",
            "parent": "V5.3"
          },
          {
            "bom-ref": "V5.4",
            "identifier": "V5.4",
            "title": "Téléchargement de fichier",
            "parent": "V5"
          },
          {
            "bom-ref": "V5.4.1",
            "identifier": "V5.4.1",
            "text": "Vérifiez que l’application valide ou ignore les noms de fichiers soumis par l’utilisateur, y compris dans un paramètre JSON, JSONP ou URL et spécifie un nom de fichier dans le champ d’en-tête Content-Disposition de la réponse.",
            "parent": "V5.4"
          },
          {
            "bom-ref": "V5.4.2",
            "identifier": "V5.4.2",
            "text": "Vérifiez que les noms de fichiers servis (par exemple, dans les champs d'en-tête de réponse HTTP ou les pièces jointes aux e-mails) sont encodés ou nettoyés (par exemple, conformément à la RFC 6266) pour préserver la structure du document et empêcher les attaques par injection.",
            "parent": "V5.4"
          },
          {
            "bom-ref": "V5.4.3",
            "identifier": "V5.4.3",
            "text": "Vérifiez que les fichiers obtenus à partir de sources non fiables sont analysés par des scanners antivirus pour empêcher la diffusion de contenu malveillant connu.",
            "parent": "V5.4"
          },
          {
            "bom-ref": "V6",
            "identifier": "V6",
            "title": "Authentification"
          },
          {
            "bom-ref": "V6.1",
            "identifier": "V6.1",
            "title": "Documentation d'authentification",
            "parent": "V6"
          },
          {
            "bom-ref": "V6.1.1",
            "identifier": "V6.1.1",
            "text": "Vérifiez que la documentation de l'application définit comment les contrôles, tels que la limitation de débit, l'anti-automatisation et la réponse adaptative, sont utilisés pour se défendre contre les attaques telles que le « credential stuffing » et la force brute des mots de passe. La documentation doit expliquer clairement comment ces contrôles sont configurés et empêcher le blocage malveillant des comptes.",
            "parent": "V6.1"
          },
          {
            "bom-ref": "V6.1.2",
            "identifier": "V6.1.2",
            "text": "Vérifiez qu'une liste de mots spécifiques au contexte est documentée afin d'empêcher leur utilisation dans les mots de passe. Cette liste peut inclure des permutations de noms d'organisations, de produits, d'identifiants de systèmes, de noms de codes de projets, de noms de services ou de rôles, etc.",
            "parent": "V6.1"
          },
          {
            "bom-ref": "V6.1.3",
            "identifier": "V6.1.3",
            "text": "Vérifiez que, si l'application inclut plusieurs voies d'authentification, celles-ci sont toutes documentées avec les contrôles de sécurité et la force d'authentification qui doivent être appliqués de manière cohérente.",
            "parent": "V6.1"
          },
          {
            "bom-ref": "V6.2",
            "identifier": "V6.2",
            "title": "Sécurité des mots de passe",
            "parent": "V6"
          },
          {
            "bom-ref": "V6.2.1",
            "identifier": "V6.2.1",
            "text": "Vérifiez que les mots de passe définis par l'utilisateur comportent au moins 8 caractères, bien qu'un minimum de 15 caractères soit fortement recommandé.",
            "parent": "V6.2"
          },
          {
            "bom-ref": "V6.2.2",
            "identifier": "V6.2.2",
            "text": "Vérifiez que les utilisateurs peuvent modifier leur mot de passe.",
            "parent": "V6.2"
          },
          {
            "bom-ref": "V6.2.3",
            "identifier": "V6.2.3",
            "text": "Vérifiez que la fonctionnalité de changement de mot de passe nécessite le mot de passe actuel et le nouveau mot de passe de l'utilisateur.",
            "parent": "V6.2"
          },
          {
            "bom-ref": "V6.2.4",
            "identifier": "V6.2.4",
            "text": "Vérifiez que les mots de passe soumis lors de l'enregistrement du compte ou du changement de mot de passe sont vérifiés par rapport à un ensemble disponible d'au moins 3 000 mots de passe principaux qui correspondent à la politique de mot de passe de l'application, par exemple la longueur minimale.",
            "parent": "V6.2"
          },
          {
            "bom-ref": "V6.2.5",
            "identifier": "V6.2.5",
            "text": "Vérifiez que les mots de passe peuvent être utilisés, quelle que soit leur composition, sans restriction quant au type de caractères autorisés. Aucun nombre minimal de majuscules ou de minuscules, de chiffres ou de caractères spéciaux ne doit être exigé.",
            "parent": "V6.2"
          },
          {
            "bom-ref": "V6.2.6",
            "identifier": "V6.2.6",
            "text": "Vérifiez que les champs de saisie du mot de passe utilisent type=password pour masquer la saisie. Les applications peuvent permettre à l'utilisateur d'afficher temporairement l'intégralité du mot de passe masqué ou le dernier caractère saisi.",
            "parent": "V6.2"
          },
          {
            "bom-ref": "V6.2.7",
            "identifier": "V6.2.7",
            "text": "Vérifiez que la fonctionnalité « coller », les assistants de mot de passe du navigateur et les gestionnaires de mots de passe externes sont autorisés.",
            "parent": "V6.2"
          },
          {
            "bom-ref": "V6.2.8",
            "identifier": "V6.2.8",
            "text": "Vérifiez que l'application vérifie le mot de passe de l'utilisateur exactement tel qu'il a été reçu de l'utilisateur, sans aucune modification telle qu'une troncature ou une transformation de casse.",
            "parent": "V6.2"
          },
          {
            "bom-ref": "V6.2.9",
            "identifier": "V6.2.9",
            "text": "Vérifiez que les mots de passe d’au moins 64 caractères sont autorisés.",
            "parent": "V6.2"
          },
          {
            "bom-ref": "V6.2.10",
            "identifier": "V6.2.10",
            "text": "Vérifiez que le mot de passe d'un utilisateur reste valide jusqu'à ce qu'il soit découvert comme compromis ou qu'il soit renouvelé. L'application ne doit pas exiger de renouvellement périodique des identifiants.",
            "parent": "V6.2"
          },
          {
            "bom-ref": "V6.2.11",
            "identifier": "V6.2.11",
            "text": "Vérifiez que la liste documentée de mots spécifiques au contexte est utilisée pour éviter la création de mots de passe faciles à deviner.",
            "parent": "V6.2"
          },
          {
            "bom-ref": "V6.2.12",
            "identifier": "V6.2.12",
            "text": "Vérifiez que les mots de passe soumis lors de l'enregistrement du compte ou des modifications de mot de passe sont vérifiés par rapport à un ensemble de mots de passe fuités.",
            "parent": "V6.2"
          },
          {
            "bom-ref": "V6.3",
            "identifier": "V6.3",
            "title": "Sécurité générale de l'authentification",
            "parent": "V6"
          },
          {
            "bom-ref": "V6.3.1",
            "identifier": "V6.3.1",
            "text": "Vérifiez que les contrôles visant à empêcher les attaques telles que le bourrage d'informations d'identification et la force brute des mots de passe sont mis en œuvre conformément à la documentation de sécurité de l'application.",
            "parent": "V6.3"
          },
          {
            "bom-ref": "V6.3.2",
            "identifier": "V6.3.2",
            "text": "Vérifiez que les comptes d’utilisateur par défaut (par exemple, « root », « admin » ou « sa ») ne sont pas présents dans l’application ou sont désactivés.",
            "parent": "V6.3"
          },
          {
            "bom-ref": "V6.3.3",
            "identifier": "V6.3.3",
            "text": "Vérifiez que l’application exige que les utilisateurs utilisent un mécanisme d’authentification multifacteur ou une combinaison de mécanismes d’authentification à facteur unique.",
            "parent": "V6.3"
          },
          {
            "bom-ref": "V6.3.4",
            "identifier": "V6.3.4",
            "text": "Vérifiez que, si l’application inclut plusieurs voies d’authentification, il n’existe aucune voie non documentée et que les contrôles de sécurité et la force d’authentification sont appliqués de manière cohérente.",
            "parent": "V6.3"
          },
          {
            "bom-ref": "V6.3.5",
            "identifier": "V6.3.5",
            "text": "Vérifiez que les utilisateurs sont informés des tentatives d'authentification suspectes (réussies ou non). Il peut s'agir de tentatives d'authentification provenant d'un emplacement ou d'un client inhabituel, d'une authentification partiellement réussie (un seul facteur parmi plusieurs), d'une tentative d'authentification après une longue période d'inactivité ou d'une authentification réussie après plusieurs tentatives infructueuses.",
            "parent": "V6.3"
          },
          {
            "bom-ref": "V6.3.6",
            "identifier": "V6.3.6",
            "text": "Vérifiez que le courrier électronique n’est pas utilisé comme mécanisme d’authentification à facteur unique ou à facteurs multiples.",
            "parent": "V6.3"
          },
          {
            "bom-ref": "V6.3.7",
            "identifier": "V6.3.7",
            "text": "Vérifiez que les utilisateurs sont avertis après les mises à jour des détails d'authentification, telles que les réinitialisations d'informations d'identification ou la modification du nom d'utilisateur ou de l'adresse e-mail.",
            "parent": "V6.3"
          },
          {
            "bom-ref": "V6.3.8",
            "identifier": "V6.3.8",
            "text": "Vérifiez que les utilisateurs valides ne peuvent pas être déduits d'échecs d'authentification, par exemple en se basant sur des messages d'erreur, des codes de réponse HTTP ou des temps de réponse différents. Les fonctionnalités d'inscription et de mot de passe oublié doivent également bénéficier de cette protection.",
            "parent": "V6.3"
          },
          {
            "bom-ref": "V6.4",
            "identifier": "V6.4",
            "title": "Cycle de vie et récupération du facteur d'authentification",
            "parent": "V6"
          },
          {
            "bom-ref": "V6.4.1",
            "identifier": "V6.4.1",
            "text": "Vérifiez que les mots de passe initiaux ou les codes d'activation générés par le système sont générés de manière aléatoire et sécurisée, qu'ils respectent la politique de mots de passe en vigueur et qu'ils expirent après une courte période ou après leur première utilisation. Ces secrets initiaux ne doivent pas devenir des mots de passe permanents.",
            "parent": "V6.4"
          },
          {
            "bom-ref": "V6.4.2",
            "identifier": "V6.4.2",
            "text": "Vérifiez que les indices de mot de passe ou l'authentification basée sur les connaissances (appelées « questions secrètes ») ne sont pas présents.",
            "parent": "V6.4"
          },
          {
            "bom-ref": "V6.4.3",
            "identifier": "V6.4.3",
            "text": "Vérifiez qu'un processus sécurisé de réinitialisation d'un mot de passe oublié est mis en œuvre, qui ne contourne aucun mécanisme d'authentification multifacteur activé.",
            "parent": "V6.4"
          },
          {
            "bom-ref": "V6.4.4",
            "identifier": "V6.4.4",
            "text": "Vérifiez que si un facteur d'authentification multifacteur est perdu, la preuve de vérification d'identité est effectuée au même niveau que lors de l'inscription.",
            "parent": "V6.4"
          },
          {
            "bom-ref": "V6.4.5",
            "identifier": "V6.4.5",
            "text": "Vérifiez que les instructions de renouvellement des mécanismes d'authentification qui expirent sont envoyées avec suffisamment de temps pour être exécutées avant l'expiration de l'ancien mécanisme d'authentification, en configurant des rappels automatiques si nécessaire.",
            "parent": "V6.4"
          },
          {
            "bom-ref": "V6.4.6",
            "identifier": "V6.4.6",
            "text": "Vérifiez que les administrateurs peuvent initier la réinitialisation du mot de passe de l'utilisateur, mais que cela ne leur permet pas de modifier ou de choisir son mot de passe. Cela évite qu'ils ne connaissent le mot de passe de l'utilisateur.",
            "parent": "V6.4"
          },
          {
            "bom-ref": "V6.5",
            "identifier": "V6.5",
            "title": "Exigences générales en matière d'authentification multifacteur",
            "parent": "V6"
          },
          {
            "bom-ref": "V6.5.1",
            "identifier": "V6.5.1",
            "text": "Vérifiez que les secrets de recherche, les demandes ou codes d'authentification out-of-band et les mots de passe à usage unique basés sur le temps (TOTP) ne peuvent être utilisés avec succès qu'une seule fois.",
            "parent": "V6.5"
          },
          {
            "bom-ref": "V6.5.2",
            "identifier": "V6.5.2",
            "text": "Vérifiez que, lors de leur stockage dans le backend de l'application, les secrets de recherche comportant moins de 112 bits d'entropie (19 caractères alphanumériques aléatoires ou 34 chiffres aléatoires) sont hachés avec un algorithme de hachage de stockage de mots de passe approuvé, intégrant un sel aléatoire de 32 bits. Une fonction de hachage standard peut être utilisée si le secret comporte 112 bits d'entropie ou plus.",
            "parent": "V6.5"
          },
          {
            "bom-ref": "V6.5.3",
            "identifier": "V6.5.3",
            "text": "Vérifiez que les secrets de recherche, le code d'authentification out-of-band et les mots de passe à usage unique basés sur le temps sont générés à l'aide d'un générateur de nombres pseudo-aléatoires cryptographiquement sécurisé (CSPRNG) pour éviter les valeurs prévisibles.",
            "parent": "V6.5"
          },
          {
            "bom-ref": "V6.5.4",
            "identifier": "V6.5.4",
            "text": "Vérifiez que les secrets de recherche et les codes d'authentification out-of-band ont un minimum de 20 bits d'entropie (généralement 4 caractères alphanumériques aléatoires ou 6 chiffres aléatoires suffisent).",
            "parent": "V6.5"
          },
          {
            "bom-ref": "V6.5.5",
            "identifier": "V6.5.5",
            "text": "Vérifiez que les requêtes, codes ou jetons d'authentification out-of-band, ainsi que les mots de passe à usage unique (TOTP), ont une durée de vie définie. Les requêtes out-of-band doivent avoir une durée de vie maximale de 10 minutes et les TOTP, de 30 secondes.",
            "parent": "V6.5"
          },
          {
            "bom-ref": "V6.5.6",
            "identifier": "V6.5.6",
            "text": "Vérifiez que tout facteur d’authentification (y compris les appareils physiques) peut être révoqué en cas de vol ou autre perte.",
            "parent": "V6.5"
          },
          {
            "bom-ref": "V6.5.7",
            "identifier": "V6.5.7",
            "text": "Vérifiez que les mécanismes d’authentification biométrique ne sont utilisés que comme facteurs secondaires, avec quelque chose que vous possédez ou quelque chose que vous savez.",
            "parent": "V6.5"
          },
          {
            "bom-ref": "V6.5.8",
            "identifier": "V6.5.8",
            "text": "Vérifiez que les mots de passe à usage unique basés sur le temps (TOTP) sont vérifiés en fonction d'une source temporelle provenant d'un service de confiance et non d'une heure non fiable ou fournie par le client.",
            "parent": "V6.5"
          },
          {
            "bom-ref": "V6.6",
            "identifier": "V6.6",
            "title": "Mécanismes d'authentification out-of-band",
            "parent": "V6"
          },
          {
            "bom-ref": "V6.6.1",
            "identifier": "V6.6.1",
            "text": "Vérifier que les mécanismes d'authentification utilisant le réseau téléphonique public commuté (RTPC) pour la transmission de mots de passe à usage unique (OTP) par téléphone ou SMS ne sont proposés que lorsque le numéro de téléphone a été préalablement validé. D'autres méthodes plus robustes (telles que les mots de passe à usage unique à durée déterminée) sont également proposées, et que le service informe les utilisateurs des risques de sécurité qu'elles présentent. Pour les applications de niveau 3, le téléphone et les SMS ne doivent pas être disponibles.",
            "parent": "V6.6"
          },
          {
            "bom-ref": "V6.6.2",
            "identifier": "V6.6.2",
            "text": "Vérifiez que les demandes d’authentification out-of-band, les codes ou les jetons sont liés à la demande d’authentification d’origine pour laquelle ils ont été générés et ne sont pas utilisables pour une demande précédente ou ultérieure.",
            "parent": "V6.6"
          },
          {
            "bom-ref": "V6.6.3",
            "identifier": "V6.6.3",
            "text": "Vérifiez qu'un mécanisme d'authentification out-of-band basé sur du code est protégé contre les attaques par force brute grâce au \"rate limiting\". Envisagez également d'utiliser un code avec au moins 64 bits d'entropie.",
            "parent": "V6.6"
          },
          {
            "bom-ref": "V6.6.4",
            "identifier": "V6.6.4",
            "text": "Vérifiez que, lorsque les notifications push sont utilisées pour l'authentification multifacteur, le \"rate limiting\" est appliqué afin d'empêcher les attaques de type « push bombing ». La concordance des numéros peut également atténuer ce risque.",
            "parent": "V6.6"
          },
          {
            "bom-ref": "V6.7",
            "identifier": "V6.7",
            "title": "Mécanisme d'authentification cryptographique",
            "parent": "V6"
          },
          {
            "bom-ref": "V6.7.1",
            "identifier": "V6.7.1",
            "text": "Vérifiez que les certificats utilisés pour vérifier les assertions d’authentification cryptographique sont stockés de manière à les protéger contre toute modification.",
            "parent": "V6.7"
          },
          {
            "bom-ref": "V6.7.2",
            "identifier": "V6.7.2",
            "text": "Vérifiez que le nonce de défi a une longueur d'au moins 64 bits et qu'il est statistiquement unique ou unique sur toute la durée de vie du périphérique cryptographique.",
            "parent": "V6.7"
          },
          {
            "bom-ref": "V6.8",
            "identifier": "V6.8",
            "title": "Authentification avec un fournisseur d'identité",
            "parent": "V6"
          },
          {
            "bom-ref": "V6.8.1",
            "identifier": "V6.8.1",
            "text": "Vérifiez que, si l'application prend en charge plusieurs fournisseurs d'identité (IdP), l'identité de l'utilisateur ne peut pas être usurpée via un autre fournisseur d'identité pris en charge (par exemple, en utilisant le même identifiant utilisateur). La mesure standard consisterait à ce que l'application enregistre et identifie l'utilisateur à l'aide d'une combinaison de l'ID du fournisseur d'identité (servant d'espace de noms) et de l'ID de l'utilisateur dans le fournisseur d'identité.",
            "parent": "V6.8"
          },
          {
            "bom-ref": "V6.8.2",
            "identifier": "V6.8.2",
            "text": "Vérifiez que la présence et l'intégrité des signatures numériques sur les assertions d'authentification (par exemple sur les assertions JWT ou SAML) sont toujours validées, en rejetant toutes les assertions non signées ou ayant des signatures non valides.",
            "parent": "V6.8"
          },
          {
            "bom-ref": "V6.8.3",
            "identifier": "V6.8.3",
            "text": "Vérifiez que les assertions SAML sont traitées de manière unique et utilisées une seule fois au cours de la période de validité pour éviter les attaques par rejeu.",
            "parent": "V6.8"
          },
          {
            "bom-ref": "V6.8.4",
            "identifier": "V6.8.4",
            "text": "Si une application utilise un fournisseur d'identité (IdP) distinct et attend une force, des méthodes ou une date d'authentification spécifiques pour des fonctions spécifiques, vérifiez que l'application les vérifie à l'aide des informations renvoyées par l'IdP. Par exemple, si OIDC est utilisé, cela peut être réalisé en validant les affirmations de jeton d'identification telles que « acr », « amr » et « auth_time » (le cas échéant). Si l'IdP ne fournit pas ces informations, l'application doit disposer d'une approche de secours documentée qui suppose que le mécanisme d'authentification de force minimale a été utilisé (par exemple, une authentification à facteur unique avec nom d'utilisateur et mot de passe).",
            "parent": "V6.8"
          },
          {
            "bom-ref": "V7",
            "identifier": "V7",
            "title": "Gestion des sessions"
          },
          {
            "bom-ref": "V7.1",
            "identifier": "V7.1",
            "title": "Documentation sur la gestion des sessions",
            "parent": "V7"
          },
          {
            "bom-ref": "V7.1.1",
            "identifier": "V7.1.1",
            "text": "Vérifiez que le délai d'inactivité de la session de l'utilisateur et la durée de vie maximale absolue de la session sont documentés, sont appropriés en combinaison avec d'autres contrôles et que la documentation inclut une justification de tout écart par rapport aux exigences de réauthentification NIST SP 800-63B.",
            "parent": "V7.1"
          },
          {
            "bom-ref": "V7.1.2",
            "identifier": "V7.1.2",
            "text": "Vérifiez que la documentation définit le nombre de sessions simultanées (parallèles) autorisées pour un compte ainsi que les comportements et actions prévus à entreprendre lorsque le nombre maximal de sessions actives est atteint.",
            "parent": "V7.1"
          },
          {
            "bom-ref": "V7.1.3",
            "identifier": "V7.1.3",
            "text": "Vérifiez que tous les systèmes qui créent et gèrent des sessions utilisateur dans le cadre d'un écosystème de gestion des identités fédérées (tels que les systèmes SSO) sont documentés avec des contrôles pour coordonner la durée de vie des sessions, la résiliation et toute autre condition nécessitant une réauthentification.",
            "parent": "V7.1"
          },
          {
            "bom-ref": "V7.2",
            "identifier": "V7.2",
            "title": "Sécurité fondamentale de la gestion des sessions",
            "parent": "V7"
          },
          {
            "bom-ref": "V7.2.1",
            "identifier": "V7.2.1",
            "text": "Vérifiez que l’application effectue toutes les vérifications des jetons de session à l’aide d’un service backend de confiance.",
            "parent": "V7.2"
          },
          {
            "bom-ref": "V7.2.2",
            "identifier": "V7.2.2",
            "text": "Vérifiez que l'application utilise des jetons autonomes ou de référence générés dynamiquement pour la gestion des sessions, c'est-à-dire sans utiliser de secrets et de clés d'API statiques.",
            "parent": "V7.2"
          },
          {
            "bom-ref": "V7.2.3",
            "identifier": "V7.2.3",
            "text": "Vérifiez que si des jetons par référence sont utilisés pour représenter les sessions utilisateur, ils sont uniques et générés à l'aide d'un générateur de nombres pseudo-aléatoires cryptographiquement sécurisé (CSPRNG) et possèdent au moins 128 bits d'entropie.",
            "parent": "V7.2"
          },
          {
            "bom-ref": "V7.2.4",
            "identifier": "V7.2.4",
            "text": "Vérifiez que l’application génère un nouveau jeton de session lors de l’authentification de l’utilisateur, y compris la réauthentification, et met fin au jeton de session actuel.",
            "parent": "V7.2"
          },
          {
            "bom-ref": "V7.3",
            "identifier": "V7.3",
            "title": "Délai d'expiration de la session",
            "parent": "V7"
          },
          {
            "bom-ref": "V7.3.1",
            "identifier": "V7.3.1",
            "text": "Vérifiez qu’il existe un délai d’inactivité tel que la réauthentification soit appliquée conformément à l’analyse des risques et aux décisions de sécurité documentées.",
            "parent": "V7.3"
          },
          {
            "bom-ref": "V7.3.2",
            "identifier": "V7.3.2",
            "text": "Vérifiez qu'il existe une durée de vie maximale absolue de la session de sorte que la réauthentification soit appliquée conformément à l'analyse des risques et aux décisions de sécurité documentées.",
            "parent": "V7.3"
          },
          {
            "bom-ref": "V7.4",
            "identifier": "V7.4",
            "title": "Fin de session",
            "parent": "V7"
          },
          {
            "bom-ref": "V7.4.1",
            "identifier": "V7.4.1",
            "text": "Vérifiez que lorsque la fin de session est déclenchée (par exemple, déconnexion ou expiration), l'application interdit toute utilisation ultérieure de la session. Pour les jetons par référence ou les sessions avec état, cela implique l'invalidation des données de session au niveau du backend de l'application. Les applications utilisant des jetons autonomes nécessiteront une solution, comme la gestion d'une liste des jetons terminés, l'interdiction des jetons produits avant une date et une heure spécifique à chaque utilisateur ou la rotation d'une clé de signature spécifique à chaque utilisateur.",
            "parent": "V7.4"
          },
          {
            "bom-ref": "V7.4.2",
            "identifier": "V7.4.2",
            "text": "Vérifiez que l'application met fin à toutes les sessions actives lorsqu'un compte utilisateur est désactivé ou supprimé (par exemple, lorsqu'un employé quitte l'entreprise).",
            "parent": "V7.4"
          },
          {
            "bom-ref": "V7.4.3",
            "identifier": "V7.4.3",
            "text": "Vérifiez que l'application offre la possibilité de mettre fin à toutes les autres sessions actives après une modification ou une suppression réussie de tout facteur d'authentification (y compris la modification du mot de passe via une réinitialisation ou une récupération et, le cas échéant, une mise à jour des paramètres MFA).",
            "parent": "V7.4"
          },
          {
            "bom-ref": "V7.4.4",
            "identifier": "V7.4.4",
            "text": "Vérifiez que toutes les pages nécessitant une authentification disposent d’un accès facile et visible à la fonctionnalité de déconnexion.",
            "parent": "V7.4"
          },
          {
            "bom-ref": "V7.4.5",
            "identifier": "V7.4.5",
            "text": "Vérifiez que les administrateurs d’applications sont en mesure de mettre fin aux sessions actives pour un utilisateur individuel ou pour tous les utilisateurs.",
            "parent": "V7.4"
          },
          {
            "bom-ref": "V7.5",
            "identifier": "V7.5",
            "title": "Défenses contre les abus de session",
            "parent": "V7"
          },
          {
            "bom-ref": "V7.5.1",
            "identifier": "V7.5.1",
            "text": "Vérifiez que l'application nécessite une réauthentification complète avant d'autoriser les modifications des attributs de compte sensibles qui peuvent affecter l'authentification, tels que l'adresse e-mail, le numéro de téléphone, la configuration MFA ou d'autres informations utilisées dans la récupération de compte.",
            "parent": "V7.5"
          },
          {
            "bom-ref": "V7.5.2",
            "identifier": "V7.5.2",
            "text": "Vérifiez que les utilisateurs peuvent afficher et (après s'être authentifiés à nouveau avec au moins un facteur) terminer une ou toutes les sessions actuellement actives.",
            "parent": "V7.5"
          },
          {
            "bom-ref": "V7.5.3",
            "identifier": "V7.5.3",
            "text": "Vérifiez que l’application nécessite une authentification supplémentaire avec au moins un facteur ou une vérification secondaire avant d’effectuer des transactions ou des opérations hautement sensibles.",
            "parent": "V7.5"
          },
          {
            "bom-ref": "V7.6",
            "identifier": "V7.6",
            "title": "Réauthentification fédérée",
            "parent": "V7"
          },
          {
            "bom-ref": "V7.6.1",
            "identifier": "V7.6.1",
            "text": "Vérifiez que la durée de vie et la fin de la session entre les parties de confiance (RP) et les fournisseurs d'identité (IdP) se comportent comme documenté, en exigeant une réauthentification si nécessaire, par exemple lorsque le temps maximal entre les événements d'authentification IdP est atteint.",
            "parent": "V7.6"
          },
          {
            "bom-ref": "V7.6.2",
            "identifier": "V7.6.2",
            "text": "Vérifiez que la création d'une session nécessite soit le consentement de l'utilisateur, soit une action explicite, empêchant ainsi la création de nouvelles sessions d'application sans interaction de l'utilisateur.",
            "parent": "V7.6"
          },
          {
            "bom-ref": "V8",
            "identifier": "V8",
            "title": "Autorisation"
          },
          {
            "bom-ref": "V8.1",
            "identifier": "V8.1",
            "title": "Documentation d'autorisation",
            "parent": "V8"
          },
          {
            "bom-ref": "V8.1.1",
            "identifier": "V8.1.1",
            "text": "Vérifiez que la documentation d’autorisation définit des règles de restriction de l’accès au niveau de la fonction et aux données en fonction des autorisations du consommateur et des attributs des ressources.",
            "parent": "V8.1"
          },
          {
            "bom-ref": "V8.1.2",
            "identifier": "V8.1.2",
            "text": "Vérifiez que la documentation d'autorisation définit les règles de restriction d'accès au niveau des champs (lecture et écriture) en fonction des autorisations des consommateurs et des attributs des ressources. Notez que ces règles peuvent dépendre d'autres valeurs d'attributs de l'objet de données concerné, telles que l'état ou le statut.",
            "parent": "V8.1"
          },
          {
            "bom-ref": "V8.1.3",
            "identifier": "V8.1.3",
            "text": "Vérifiez que la documentation de l'application définit les attributs environnementaux et contextuels (y compris, mais sans s'y limiter, l'heure de la journée, l'emplacement de l'utilisateur, l'adresse IP ou l'appareil) qui sont utilisés dans l'application pour prendre des décisions de sécurité, y compris celles relatives à l'authentification et à l'autorisation.",
            "parent": "V8.1"
          },
          {
            "bom-ref": "V8.1.4",
            "identifier": "V8.1.4",
            "text": "Vérifier que la documentation d'authentification et d'autorisation définit l'utilisation des facteurs environnementaux et contextuels dans la prise de décision, en plus des autorisations au niveau des fonctions, des données et des champs. Cela doit inclure les attributs évalués, les seuils de risque et les actions entreprises (par exemple, autorisation, contestation, refus, renforcement de l'authentification).",
            "parent": "V8.1"
          },
          {
            "bom-ref": "V8.2",
            "identifier": "V8.2",
            "title": "Conception d'autorisation générale",
            "parent": "V8"
          },
          {
            "bom-ref": "V8.2.1",
            "identifier": "V8.2.1",
            "text": "Vérifiez que l’application garantit que l’accès basé sur la fonction est limité aux consommateurs disposant d’autorisations explicites.",
            "parent": "V8.2"
          },
          {
            "bom-ref": "V8.2.2",
            "identifier": "V8.2.2",
            "text": "Vérifiez que l'application garantit que l'accès spécifique aux données est limité aux consommateurs disposant d'autorisations explicites sur des éléments de données spécifiques afin d'atténuer les références d'objet directes non sécurisées (IDOR) et les autorisations de niveau d'objet rompues (BOLA).",
            "parent": "V8.2"
          },
          {
            "bom-ref": "V8.2.3",
            "identifier": "V8.2.3",
            "text": "Vérifiez que l'application garantit que l'accès au niveau du champ est limité aux consommateurs disposant d'autorisations explicites sur des champs spécifiques afin d'atténuer les problèmes d'autorisation au niveau de la propriété d'objet (BOPLA).",
            "parent": "V8.2"
          },
          {
            "bom-ref": "V8.2.4",
            "identifier": "V8.2.4",
            "text": "Vérifiez que les contrôles de sécurité adaptatifs basés sur les attributs environnementaux et contextuels du consommateur (tels que l'heure, la localisation, l'adresse IP ou l'appareil) sont mis en œuvre pour les décisions d'authentification et d'autorisation, comme défini dans la documentation de l'application. Ces contrôles doivent être appliqués lorsque le consommateur tente de démarrer une nouvelle session et également pendant une session existante.",
            "parent": "V8.2"
          },
          {
            "bom-ref": "V8.3",
            "identifier": "V8.3",
            "title": "Autorisation par opération",
            "parent": "V8"
          },
          {
            "bom-ref": "V8.3.1",
            "identifier": "V8.3.1",
            "text": "Vérifier que l'application applique les règles d'autorisations au niveau de la couche service de confiance et ne s’appuie pas sur des contrôles qu’un consommateur non approuvé pourrait manipuler, comme JavaScript côté client.",
            "parent": "V8.3"
          },
          {
            "bom-ref": "V8.3.2",
            "identifier": "V8.3.2",
            "text": "Vérifiez que les modifications apportées aux valeurs sur lesquelles reposent les décisions d'autorisation sont appliquées immédiatement. Lorsque les modifications ne peuvent pas être appliquées immédiatement (par exemple, en s'appuyant sur des données de jetons autonomes), des contrôles d'atténuation doivent être mis en place pour alerter un consommateur lorsqu'il effectue une action alors qu'il n'est plus autorisé à le faire et annuler la modification. Notez que cette solution alternative ne limiterait pas les fuites d'informations.",
            "parent": "V8.3"
          },
          {
            "bom-ref": "V8.3.3",
            "identifier": "V8.3.3",
            "text": "Vérifiez que l'accès à un objet repose sur les autorisations du sujet d'origine (par exemple, le consommateur), et non sur celles d'un intermédiaire ou d'un service agissant en son nom. Par exemple, si un consommateur appelle un service web à l'aide d'un jeton d'authentification autonome, et que ce service demande ensuite des données à un autre service, ce dernier utilisera le jeton du consommateur, plutôt qu'un jeton inter-machine du premier service, pour prendre les décisions d'autorisation.",
            "parent": "V8.3"
          },
          {
            "bom-ref": "V8.4",
            "identifier": "V8.4",
            "title": "Autres considérations relatives à l'autorisation",
            "parent": "V8"
          },
          {
            "bom-ref": "V8.4.1",
            "identifier": "V8.4.1",
            "text": "Vérifiez que les applications multi-tenants utilisent des contrôles inter-tenants pour garantir que les opérations des consommateurs n'affecteront jamais les tenants avec lesquels ils ne sont pas autorisés à interagir.",
            "parent": "V8.4"
          },
          {
            "bom-ref": "V8.4.2",
            "identifier": "V8.4.2",
            "text": "Vérifiez que l'accès aux interfaces administratives intègre plusieurs couches de sécurité, notamment la vérification continue de l'identité du consommateur, l'évaluation de la posture de sécurité des appareils et l'analyse contextuelle des risques, garantissant que l'emplacement du réseau ou les endpoints approuvés ne sont pas les seuls facteurs d'autorisation, même s'ils peuvent réduire la probabilité d'accès non autorisé.",
            "parent": "V8.4"
          },
          {
            "bom-ref": "V9",
            "identifier": "V9",
            "title": "Jetons autonomes"
          },
          {
            "bom-ref": "V9.1",
            "identifier": "V9.1",
            "title": "Source et intégrité du jeton",
            "parent": "V9"
          },
          {
            "bom-ref": "V9.1.1",
            "identifier": "V9.1.1",
            "text": "Vérifiez que les jetons autonomes sont validés à l'aide de leur signature numérique ou MAC pour les protéger contre toute falsification avant d'accepter le contenu du jeton.",
            "parent": "V9.1"
          },
          {
            "bom-ref": "V9.1.2",
            "identifier": "V9.1.2",
            "text": "Vérifiez que seuls les algorithmes d'une liste d’autorisations peuvent être utilisés pour créer et vérifier des jetons autonomes, dans un contexte donné. La liste d'autorisation doit inclure les algorithmes autorisés, idéalement symétriques ou asymétriques, et ne doit pas inclure l'algorithme « Aucun ». Si les algorithmes symétriques et asymétriques doivent être pris en charge, des contrôles supplémentaires seront nécessaires pour éviter toute confusion de clés.",
            "parent": "V9.1"
          },
          {
            "bom-ref": "V9.1.3",
            "identifier": "V9.1.3",
            "text": "Vérifiez que les clés utilisées pour valider les jetons autonomes proviennent de sources préconfigurées et fiables pour l'émetteur du jeton, empêchant ainsi les attaquants de spécifier des sources et des clés non fiables. Pour les JWT et autres structures JWS, les en-têtes tels que « jku », « x5u » et « jwk » doivent être validés par rapport à une liste d'autorisation de sources fiables.",
            "parent": "V9.1"
          },
          {
            "bom-ref": "V9.2",
            "identifier": "V9.2",
            "title": "Contenu du jeton",
            "parent": "V9"
          },
          {
            "bom-ref": "V9.2.1",
            "identifier": "V9.2.1",
            "text": "Vérifiez que, si une période de validité est indiquée dans les données du jeton, celui-ci et son contenu ne sont acceptés que si la date de vérification est comprise dans cette période. Par exemple, pour les JWT, les déclarations « nbf » et « exp » doivent être vérifiées.",
            "parent": "V9.2"
          },
          {
            "bom-ref": "V9.2.2",
            "identifier": "V9.2.2",
            "text": "Vérifiez que le service recevant un jeton valide le type de jeton et son utilisation avant d'en accepter le contenu. Par exemple, seuls les jetons d'accès peuvent être acceptés pour les décisions d'autorisation, et seuls les jetons d'identification peuvent être utilisés pour prouver l'authentification des utilisateurs.",
            "parent": "V9.2"
          },
          {
            "bom-ref": "V9.2.3",
            "identifier": "V9.2.3",
            "text": "Vérifiez que le service accepte uniquement les jetons destinés à être utilisés avec ce service (audience). Pour les JWT, cela peut être réalisé en validant la déclaration « aud » par rapport à une liste d'autorisation définie dans le service.",
            "parent": "V9.2"
          },
          {
            "bom-ref": "V9.2.4",
            "identifier": "V9.2.4",
            "text": "Si un émetteur de jetons utilise la même clé privée pour émettre des jetons destinés à différentes audiences, vérifiez que les jetons émis contiennent une restriction d'audience identifiant de manière unique les audiences visées. Cela empêchera la réutilisation d'un jeton avec une audience non prévue. Si l'identifiant d'audience est provisionné dynamiquement, l'émetteur de jetons doit valider ces audiences afin de garantir qu'elles n'entraînent pas d'usurpation d'identité.",
            "parent": "V9.2"
          },
          {
            "bom-ref": "V10",
            "identifier": "V10",
            "title": "Oauth et OIDC"
          },
          {
            "bom-ref": "V10.1",
            "identifier": "V10.1",
            "title": "Sécurité générique OAuth et OIDC",
            "parent": "V10"
          },
          {
            "bom-ref": "V10.1.1",
            "identifier": "V10.1.1",
            "text": "Vérifiez que les jetons sont envoyés uniquement aux composants qui en ont absolument besoin. Par exemple, lors de l'utilisation d'un modèle backend-for-frontend pour les applications JavaScript basées sur un navigateur, les jetons d'accès et d'actualisation ne doivent être accessibles qu'au backend.",
            "parent": "V10.1"
          },
          {
            "bom-ref": "V10.1.2",
            "identifier": "V10.1.2",
            "text": "Vérifiez que le client n'accepte les valeurs du serveur d'autorisation (telles que le code d'autorisation ou le jeton d'identification) que si elles résultent d'un flux d'autorisation initié par la même session d'agent utilisateur et la même transaction. Cela nécessite que les secrets générés par le client, tels que la clé de preuve pour l'échange de codes (PKCE) « code_verifier », « state » ou le nonce OIDC, ne puissent être devinés, soient spécifiques à la transaction et soient liés de manière sécurisée au client et à la session d'agent utilisateur au cours de laquelle la transaction a été initiée.",
            "parent": "V10.1"
          },
          {
            "bom-ref": "V10.2",
            "identifier": "V10.2",
            "title": "Client OAuth",
            "parent": "V10"
          },
          {
            "bom-ref": "V10.2.1",
            "identifier": "V10.2.1",
            "text": "Vérifiez que, si le flux de code est utilisé, le client OAuth dispose d'une protection contre les attaques de falsification de requêtes basées sur le navigateur, communément appelées falsification de requêtes intersites (CSRF), qui déclenchent des demandes de jetons, soit en utilisant la fonctionnalité de clé de preuve pour l'échange de code (PKCE), soit en vérifiant le paramètre « state » envoyé dans la demande d'autorisation.",
            "parent": "V10.2"
          },
          {
            "bom-ref": "V10.2.2",
            "identifier": "V10.2.2",
            "text": "Vérifiez que, si le client OAuth peut interagir avec plusieurs serveurs d'autorisation, il dispose d'une protection contre les attaques par confusion. Par exemple, il peut exiger que le serveur d'autorisation renvoie la valeur du paramètre « iss » et la valide dans la réponse d'autorisation et la réponse du jeton.",
            "parent": "V10.2"
          },
          {
            "bom-ref": "V10.2.3",
            "identifier": "V10.2.3",
            "text": "Vérifiez que le client OAuth demande uniquement les portées requises (ou d’autres paramètres d’autorisation) dans les requêtes adressées au serveur d’autorisation.",
            "parent": "V10.2"
          },
          {
            "bom-ref": "V10.3",
            "identifier": "V10.3",
            "title": "Serveur de ressources OAuth",
            "parent": "V10"
          },
          {
            "bom-ref": "V10.3.1",
            "identifier": "V10.3.1",
            "text": "Vérifiez que le serveur de ressources accepte uniquement les jetons d'accès destinés à être utilisés avec ce service (audience). L'audience peut être incluse dans un jeton d'accès structuré (comme la déclaration « aud » dans JWT) ou vérifiée à l'aide du endpoint d'introspection de jeton.",
            "parent": "V10.3"
          },
          {
            "bom-ref": "V10.3.2",
            "identifier": "V10.3.2",
            "text": "Vérifiez que le serveur de ressources applique les décisions d'autorisation en fonction des déclarations du jeton d'accès définissant l'autorisation déléguée. Si des déclarations telles que « sub », « scope » et « authorization_details » sont présentes, elles doivent être prises en compte dans la décision.",
            "parent": "V10.3"
          },
          {
            "bom-ref": "V10.3.3",
            "identifier": "V10.3.3",
            "text": "Vérifiez que si une décision de contrôle d'accès nécessite l'identification d'un utilisateur unique à partir d'un jeton d'accès (JWT ou réponse d'introspection de jeton associé), le serveur de ressources identifie l'utilisateur à partir de déclarations non ré attribuables à d'autres utilisateurs. En général, cela implique l'utilisation d'une combinaison de déclarations « iss » et « sub ».",
            "parent": "V10.3"
          },
          {
            "bom-ref": "V10.3.4",
            "identifier": "V10.3.4",
            "text": "Si le serveur de ressources requiert une force d'authentification, des méthodes ou une date d'expiration spécifiques, vérifiez que le jeton d'accès présenté respecte ces contraintes. Par exemple, s'il est présent, utilisez les déclarations OIDC « acr », « amr » et « auth_time » respectivement.",
            "parent": "V10.3"
          },
          {
            "bom-ref": "V10.3.5",
            "identifier": "V10.3.5",
            "text": "Vérifiez que le serveur de ressources empêche l'utilisation de jetons d'accès volés ou la relecture de jetons d'accès (de parties non autorisées) en exigeant des jetons d'accès limités par l'expéditeur, soit Mutual TLS pour OAuth 2, soit OAuth 2 Demonstration of Proof of Possession (DPoP).",
            "parent": "V10.3"
          },
          {
            "bom-ref": "V10.4",
            "identifier": "V10.4",
            "title": "Serveur d'autorisation OAuth",
            "parent": "V10"
          },
          {
            "bom-ref": "V10.4.1",
            "identifier": "V10.4.1",
            "text": "Vérifiez que le serveur d'autorisation valide les URI de redirection en fonction d'une liste d'autorisation spécifique au client d'URI préenregistrés à l'aide d'une comparaison de chaînes exacte.",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.2",
            "identifier": "V10.4.2",
            "text": "Vérifiez que, si le serveur d'autorisation renvoie le code d'autorisation dans la réponse, celui-ci ne peut être utilisé qu'une seule fois pour une demande de jeton. Pour la deuxième demande valide avec un code d'autorisation déjà utilisé pour émettre un jeton d'accès, le serveur d'autorisation doit rejeter la demande de jeton et révoquer tous les jetons émis liés au code d'autorisation.",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.3",
            "identifier": "V10.4.3",
            "text": "Vérifiez que le code d'autorisation est de courte durée. La durée de vie maximale peut atteindre 10 minutes pour les applications L1 et L2 et 1 minute pour les applications L3.",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.4",
            "identifier": "V10.4.4",
            "text": "Vérifiez que, pour un client donné, le serveur d'autorisation autorise uniquement l'utilisation des autorisations nécessaires à ce client. Notez que les autorisations « token » (flux implicite) et « password » (flux d'informations d'identification du propriétaire de la ressource) ne doivent plus être utilisées.",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.5",
            "identifier": "V10.4.5",
            "text": "Vérifiez que le serveur d'autorisation atténue les attaques par rejeu de jetons d'actualisation pour les clients publics, de préférence en utilisant des jetons d'actualisation limités par l'expéditeur, par exemple des jetons DPoP (Demonstrating Proof of Possession) ou des jetons d'accès liés à un certificat utilisant le protocole TLS mutuel (mTLS). Pour les applications L1 et L2, la rotation des jetons d'actualisation peut être utilisée. Si cette rotation est utilisée, le serveur d'autorisation doit invalider le jeton d'actualisation après utilisation et révoquer tous les jetons d'actualisation de cette autorisation si un jeton d'actualisation déjà utilisé et invalidé est fourni.",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.6",
            "identifier": "V10.4.6",
            "text": "Vérifiez que, si l'octroi de code est utilisé, le serveur d'autorisation atténue les attaques par interception de code en exigeant une clé de preuve pour l'échange de code (PKCE). Pour les demandes d'autorisation, le serveur d'autorisation doit exiger une valeur « code_challenge » valide et ne doit pas accepter une valeur « plain » pour « code_challenge_method ». Pour une demande de jeton, il doit exiger la validation du paramètre « code_verifier ».",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.7",
            "identifier": "V10.4.7",
            "text": "Vérifiez que si le serveur d'autorisation prend en charge l'enregistrement dynamique des clients non authentifiés, il réduit le risque d'applications clientes malveillantes. Il doit valider les métadonnées clientes, telles que les URI enregistrés, garantir le consentement de l'utilisateur et l'avertir avant de traiter une demande d'autorisation avec une application cliente non approuvée.",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.8",
            "identifier": "V10.4.8",
            "text": "Vérifiez que les jetons d’actualisation ont une expiration absolue, y compris si l’expiration du jeton d’actualisation glissant est appliquée.",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.9",
            "identifier": "V10.4.9",
            "text": "Vérifiez que les jetons d'actualisation et les jetons d'accès de référence peuvent être révoqués par un utilisateur autorisé à l'aide de l'interface utilisateur du serveur d'autorisation, afin d'atténuer le risque de clients malveillants ou de jetons volés.",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.10",
            "identifier": "V10.4.10",
            "text": "Vérifiez que le client confidentiel est authentifié pour les demandes de back-channel client-serveur autorisé telles que les demandes de jeton, les demandes d'autorisation poussée (PAR) et les demandes de révocation de jeton.",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.11",
            "identifier": "V10.4.11",
            "text": "Vérifiez que le client confidentiel est authentifié pour les demandes de back-channel client-serveur autorisé telles que les demandes de jeton, les demandes d'autorisation poussée (PAR) et les demandes de révocation de jeton.",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.12",
            "identifier": "V10.4.12",
            "text": "Vérifiez que, pour un client donné, le serveur d'autorisation autorise uniquement la valeur « response_mode » dont ce client a besoin. Par exemple, en vérifiant cette valeur par rapport aux valeurs attendues ou en utilisant une requête d'autorisation poussée (PAR) ou une requête d'autorisation sécurisée par JWT (JAR).",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.13",
            "identifier": "V10.4.13",
            "text": "Vérifiez que le type d'Autorisation « code » est toujours utilisé avec les demandes d'autorisation poussées (PAR).",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.14",
            "identifier": "V10.4.14",
            "text": "Vérifiez que le serveur d'autorisation émet uniquement des jetons d'accès limités à l'expéditeur (preuve de possession), soit avec des jetons d'accès liés au certificat utilisant TLS mutuel (mTLS), soit avec des jetons d'accès liés au DPoP (démonstration de preuve de possession).",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.15",
            "identifier": "V10.4.15",
            "text": "Vérifiez que, pour un client côté serveur (non exécuté sur l'appareil de l'utilisateur final), le serveur d'autorisation garantit que la valeur du paramètre « authorization_details » provient du backend client et que l'utilisateur ne l'a pas altérée. Par exemple, en exigeant l'utilisation d'une demande d'autorisation poussée (PAR) ou d'une demande d'autorisation sécurisée par JWT (JAR).",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.4.16",
            "identifier": "V10.4.16",
            "text": "Vérifiez que le client est confidentiel et que le serveur d'autorisation requiert l'utilisation de méthodes d'authentification client fortes (basées sur la cryptographie à clé publique et résistantes aux attaques par relecture), telles que TLS mutuel ('tls_client_auth', 'self_signed_tls_client_auth') ou JWT à clé privée ('private_key_jwt').",
            "parent": "V10.4"
          },
          {
            "bom-ref": "V10.5",
            "identifier": "V10.5",
            "title": "Client OIDC",
            "parent": "V10"
          },
          {
            "bom-ref": "V10.5.1",
            "identifier": "V10.5.1",
            "text": "Vérifiez que le client (en tant que partie utilisatrice) atténue les attaques par rejeu de jeton d'identification. Par exemple, en vous assurant que la valeur « nonce » du jeton d'identification correspond à la valeur « nonce » envoyée dans la demande d'authentification au fournisseur OpenID (appelée demande d'autorisation envoyée au serveur d'autorisation dans OAuth2).",
            "parent": "V10.5"
          },
          {
            "bom-ref": "V10.5.2",
            "identifier": "V10.5.2",
            "text": "Vérifiez que le client identifie de manière unique l'utilisateur à partir des déclarations de jeton d'identification, généralement la déclaration « sub », qui ne peut pas être réaffectée à d'autres utilisateurs (pour la portée d'un fournisseur d'identité).",
            "parent": "V10.5"
          },
          {
            "bom-ref": "V10.5.3",
            "identifier": "V10.5.3",
            "text": "Vérifiez que le client rejette les tentatives d'un serveur d'autorisation malveillant d'usurper l'identité d'un autre serveur d'autorisation via ses métadonnées. Le client doit rejeter les métadonnées du serveur d'autorisation si l'URL de l'émetteur figurant dans ces métadonnées ne correspond pas exactement à l'URL d'émetteur préconfigurée attendue par le client.",
            "parent": "V10.5"
          },
          {
            "bom-ref": "V10.5.4",
            "identifier": "V10.5.4",
            "text": "Vérifiez que le client valide que le jeton d'identification est destiné à être utilisé pour ce client (audience) en vérifiant que la déclaration « aud » du jeton est égale à la valeur « client_id » pour le client.",
            "parent": "V10.5"
          },
          {
            "bom-ref": "V10.5.5",
            "identifier": "V10.5.5",
            "text": "Vérifiez que, lors de l'utilisation de la déconnexion du back-channel OIDC, la partie utilisatrice atténue les risques de déni de service liés à la déconnexion forcée et à la confusion entre JWT dans le flux de déconnexion. Le client doit vérifier que le jeton de déconnexion est correctement typé avec la valeur « logout+jwt », qu'il contient la déclaration « event » avec le nom de membre correct et qu'il ne contient pas de déclaration « nonce ». Il est également recommandé d'utiliser une expiration courte (par exemple, 2 minutes).",
            "parent": "V10.5"
          },
          {
            "bom-ref": "V10.6",
            "identifier": "V10.6",
            "title": "Fournisseur OpenID",
            "parent": "V10"
          },
          {
            "bom-ref": "V10.6.1",
            "identifier": "V10.6.1",
            "text": "Vérifiez que le fournisseur OpenID n'autorise que les valeurs « code », « ciba », « id_token » ou « id_token code » pour le mode de réponse. Notez que « code » est préférable à « id_token code » (flux hybride OIDC) et que « token » (tout flux implicite) ne doit pas être utilisé.",
            "parent": "V10.6"
          },
          {
            "bom-ref": "V10.6.2",
            "identifier": "V10.6.2",
            "text": "Vérifiez que le fournisseur OpenID atténue les risques de déni de service liés à la déconnexion forcée. Pour ce faire, obtenez une confirmation explicite de l'utilisateur final ou, le cas échéant, validez les paramètres de la requête de déconnexion (initiée par la partie utilisatrice), comme « id_token_hint ».",
            "parent": "V10.6"
          },
          {
            "bom-ref": "V10.7",
            "identifier": "V10.7",
            "title": "Gestion du consentement",
            "parent": "V10"
          },
          {
            "bom-ref": "V10.7.1",
            "identifier": "V10.7.1",
            "text": "Vérifiez que le serveur d'autorisation garantit le consentement de l'utilisateur à chaque demande d'autorisation. Si l'identité du client ne peut être garantie, le serveur d'autorisation doit toujours demander explicitement le consentement de l'utilisateur.",
            "parent": "V10.7"
          },
          {
            "bom-ref": "V10.7.2",
            "identifier": "V10.7.2",
            "text": "Vérifiez que lorsque le serveur d'autorisation demande le consentement de l'utilisateur, il fournit des informations claires et suffisantes sur ce qui est consenti. Le cas échéant, ces informations doivent inclure la nature des autorisations demandées (généralement en fonction de la portée, du serveur de ressources et des détails d'autorisation RAR), l'identité de l'application autorisée et la durée de vie de ces autorisations.",
            "parent": "V10.7"
          },
          {
            "bom-ref": "V10.7.3",
            "identifier": "V10.7.3",
            "text": "Vérifiez que l’utilisateur peut consulter, modifier et révoquer les consentements qu’il a accordés via le serveur d’autorisation.",
            "parent": "V10.7"
          },
          {
            "bom-ref": "V11",
            "identifier": "V11",
            "title": "Cryptographie"
          },
          {
            "bom-ref": "V11.1",
            "identifier": "V11.1",
            "title": "Inventaire et documentation cryptographiques",
            "parent": "V11"
          },
          {
            "bom-ref": "V11.1.1",
            "identifier": "V11.1.1",
            "text": "Vérifiez qu’il existe une politique documentée pour la gestion des clés cryptographiques et un cycle de vie des clés cryptographiques qui suit une norme de gestion des clés telle que NIST SP 800-57. Cela devrait inclure la garantie que les clés ne sont pas sur-partagées (par exemple, avec plus de deux entités pour les secrets partagés et plus d’une entité pour les clés privées).",
            "parent": "V11.1"
          },
          {
            "bom-ref": "V11.1.2",
            "identifier": "V11.1.2",
            "text": "Vérifiez qu'un inventaire cryptographique est réalisé, maintenu et régulièrement mis à jour, et qu'il inclut toutes les clés, algorithmes et certificats cryptographiques utilisés par l'application. Il doit également documenter les emplacements du système où les clés peuvent ou non être utilisées, ainsi que les types de données qui peuvent ou non être protégées par ces clés.",
            "parent": "V11.1"
          },
          {
            "bom-ref": "V11.1.3",
            "identifier": "V11.1.3",
            "text": "Vérifiez que les mécanismes de découverte cryptographique sont utilisés pour identifier toutes les instances de cryptographie dans le système, y compris les opérations de chiffrement, de hachage et de signature.",
            "parent": "V11.1"
          },
          {
            "bom-ref": "V11.1.4",
            "identifier": "V11.1.4",
            "text": "Vérifier la tenue d'un inventaire cryptographique. Celui-ci doit inclure un plan documenté décrivant la migration vers de nouvelles normes cryptographiques, telles que la cryptographie post-quantique, afin de réagir aux menaces futures.",
            "parent": "V11.1"
          },
          {
            "bom-ref": "V11.2",
            "identifier": "V11.2",
            "title": "Mise en œuvre sécurisée de la cryptographie",
            "parent": "V11"
          },
          {
            "bom-ref": "V11.2.1",
            "identifier": "V11.2.1",
            "text": "Vérifiez que les implémentations validées par l’industrie (y compris les bibliothèques et les implémentations accélérées par le matériel) sont utilisées pour les opérations cryptographiques.",
            "parent": "V11.2"
          },
          {
            "bom-ref": "V11.2.2",
            "identifier": "V11.2.2",
            "text": "Vérifiez que l'application est conçue avec une agilité cryptographique, de sorte que les nombres aléatoires, le chiffrement authentifié, le MAC ou les algorithmes de hachage, les longueurs de clés, les tours, les chiffrements et les modes puissent être reconfigurés, mis à niveau ou échangés à tout moment, afin de se protéger contre les failles cryptographiques. De même, il doit être possible de remplacer les clés et les mots de passe, ainsi que de rechiffrer les données. Cela permettra des mises à niveau transparentes vers la cryptographie post-quantique (PQC), une fois que des implémentations hautement sécurisées de schémas ou de normes PQC approuvés seront largement disponibles.",
            "parent": "V11.2"
          },
          {
            "bom-ref": "V11.2.3",
            "identifier": "V11.2.3",
            "text": "Vérifiez que toutes les primitives cryptographiques utilisent un minimum de 128 bits de sécurité en fonction de l'algorithme, de la taille de la clé et de la configuration. Par exemple, une clé ECC de 256 bits offre environ 128 bits de sécurité, tandis que RSA nécessite une clé de 3072 bits pour atteindre 128 bits de sécurité.",
            "parent": "V11.2"
          },
          {
            "bom-ref": "V11.2.4",
            "identifier": "V11.2.4",
            "text": "Vérifiez que toutes les opérations cryptographiques sont à temps constant, sans opérations de « court-circuit » dans les comparaisons, les calculs ou les retours, pour éviter toute fuite d'informations.",
            "parent": "V11.2"
          },
          {
            "bom-ref": "V11.2.5",
            "identifier": "V11.2.5",
            "text": "Vérifiez que tous les modules cryptographiques échouent en toute sécurité et que les erreurs sont gérées de manière à ne pas permettre de vulnérabilités, telles que les attaques Padding Oracle.",
            "parent": "V11.2"
          },
          {
            "bom-ref": "V11.3",
            "identifier": "V11.3",
            "title": "Algorithmes de chiffrement",
            "parent": "V11"
          },
          {
            "bom-ref": "V11.3.1",
            "identifier": "V11.3.1",
            "text": "Vérifiez que les modes de bloc non sécurisés (par exemple, ECB) et les schémas de remplissage faibles (par exemple, PKCS#1 v1.5) ne sont pas utilisés.",
            "parent": "V11.3"
          },
          {
            "bom-ref": "V11.3.2",
            "identifier": "V11.3.2",
            "text": "Vérifiez que seuls les chiffrements et modes approuvés tels que AES avec GCM sont utilisés.",
            "parent": "V11.3"
          },
          {
            "bom-ref": "V11.3.3",
            "identifier": "V11.3.3",
            "text": "Vérifiez que les données chiffrées sont protégées contre toute modification non autorisée, de préférence en utilisant une méthode de chiffrement authentifiée approuvée ou en combinant une méthode de chiffrement approuvée avec un algorithme MAC approuvé.",
            "parent": "V11.3"
          },
          {
            "bom-ref": "V11.3.4",
            "identifier": "V11.3.4",
            "text": "Vérifiez que les nonces, les vecteurs d'initialisation et autres nombres à usage unique ne sont pas utilisés pour plus d'une paire clé de chiffrement/élément de données. La méthode de génération doit être adaptée à l'algorithme utilisé.",
            "parent": "V11.3"
          },
          {
            "bom-ref": "V11.3.5",
            "identifier": "V11.3.5",
            "text": "Vérifiez que toute combinaison d'un algorithme de chiffrement et d'un algorithme MAC fonctionne en mode chiffrement puis MAC.",
            "parent": "V11.3"
          },
          {
            "bom-ref": "V11.4",
            "identifier": "V11.4",
            "title": "Hachage et fonctions basées sur le hachage",
            "parent": "V11"
          },
          {
            "bom-ref": "V11.4.1",
            "identifier": "V11.4.1",
            "text": "Vérifiez que seules les fonctions de hachage approuvées sont utilisées pour les cas d'utilisation cryptographiques généraux, notamment les signatures numériques, HMAC, KDF et la génération de bits aléatoires. Les fonctions de hachage non autorisées, telles que MD5, ne doivent pas être utilisées à des fins cryptographiques.",
            "parent": "V11.4"
          },
          {
            "bom-ref": "V11.4.2",
            "identifier": "V11.4.2",
            "text": "Vérifiez que les mots de passe sont stockés à l'aide d'une fonction de dérivation de clés approuvée et gourmande en ressources de calcul (également appelée « fonction de hachage de mots de passe »), dont les paramètres sont configurés conformément aux directives en vigueur. Ces paramètres doivent équilibrer sécurité et performances afin de rendre les attaques par force brute suffisamment difficiles pour le niveau de sécurité requis.",
            "parent": "V11.4"
          },
          {
            "bom-ref": "V11.4.3",
            "identifier": "V11.4.3",
            "text": "Vérifiez que les fonctions de hachage utilisées dans les signatures numériques, dans le cadre de l'authentification ou de l'intégrité des données, sont résistantes aux collisions et possèdent des longueurs de bits appropriées. Si la résistance aux collisions est requise, la longueur de sortie doit être d'au moins 256 bits. Si seule la résistance aux attaques de seconde pré-image est requise, la longueur de sortie doit être d'au moins 128 bits.",
            "parent": "V11.4"
          },
          {
            "bom-ref": "V11.4.4",
            "identifier": "V11.4.4",
            "text": "Vérifiez que l'application utilise des fonctions de dérivation de clés approuvées avec des paramètres d'extension de clés lors de la dérivation de clés secrètes à partir de mots de passe. Les paramètres utilisés doivent concilier sécurité et performances afin d'empêcher les attaques par force brute de compromettre la clé cryptographique obtenue.",
            "parent": "V11.4"
          },
          {
            "bom-ref": "V11.5",
            "identifier": "V11.5",
            "title": "Valeurs aléatoires",
            "parent": "V11"
          },
          {
            "bom-ref": "V11.5.1",
            "identifier": "V11.5.1",
            "text": "Vérifiez que tous les nombres et chaînes aléatoires destinés à être non devinables doivent être générés à l'aide d'un générateur de nombres pseudo-aléatoires cryptographiquement sécurisé (CSPRNG) et posséder au moins 128 bits d'entropie. Notez que les UUID ne respectent pas cette condition.",
            "parent": "V11.5"
          },
          {
            "bom-ref": "V11.5.2",
            "identifier": "V11.5.2",
            "text": "Vérifiez que le mécanisme de génération de nombres aléatoires utilisé est conçu pour fonctionner en toute sécurité, même en cas de forte demande.",
            "parent": "V11.5"
          },
          {
            "bom-ref": "V11.6",
            "identifier": "V11.6",
            "title": "Cryptographie à clé publique",
            "parent": "V11"
          },
          {
            "bom-ref": "V11.6.1",
            "identifier": "V11.6.1",
            "text": "Vérifier que seuls des algorithmes cryptographiques et des modes opératoires approuvés sont utilisés pour la génération et l'amorçage des clés, ainsi que pour la génération et la vérification des signatures numériques. Les algorithmes de génération de clés ne doivent pas générer de clés non sécurisées et vulnérables aux attaques connues, par exemple les clés RSA vulnérables à la factorisation de Fermat.",
            "parent": "V11.6"
          },
          {
            "bom-ref": "V11.6.2",
            "identifier": "V11.6.2",
            "text": "Vérifiez que des algorithmes cryptographiques approuvés sont utilisés pour l'échange de clés (tels que Diffie-Hellman), en veillant à ce que les mécanismes d'échange de clés utilisent des paramètres sécurisés. Cela permettra d'éviter les attaques contre le processus d'établissement des clés, susceptibles de conduire à des attaques de type « adversaire du milieu » ou à des failles cryptographiques.",
            "parent": "V11.6"
          },
          {
            "bom-ref": "V11.7",
            "identifier": "V11.7",
            "title": "Cryptographie des données en cours d'utilisation",
            "parent": "V11"
          },
          {
            "bom-ref": "V11.7.1",
            "identifier": "V11.7.1",
            "text": "Vérifiez que le chiffrement complet de la mémoire est utilisé pour protéger les données sensibles pendant leur utilisation, empêchant ainsi l'accès par des utilisateurs ou des processus non autorisés.",
            "parent": "V11.7"
          },
          {
            "bom-ref": "V11.7.2",
            "identifier": "V11.7.2",
            "text": "Vérifiez que la minimisation des données garantit que la quantité minimale de données est exposée pendant le traitement et assurez-vous que les données sont chiffrées immédiatement après utilisation ou dès que possible.",
            "parent": "V11.7"
          },
          {
            "bom-ref": "V12",
            "identifier": "V12",
            "title": "Communication sécurisée"
          },
          {
            "bom-ref": "V12.1",
            "identifier": "V12.1",
            "title": "Conseils généraux de sécurité TLS",
            "parent": "V12"
          },
          {
            "bom-ref": "V12.1.1",
            "identifier": "V12.1.1",
            "text": "Vérifiez que seules les dernières versions recommandées du protocole TLS sont activées, telles que TLS 1.2 et TLS 1.3. La dernière version du protocole TLS doit être privilégiée.",
            "parent": "V12.1"
          },
          {
            "bom-ref": "V12.1.2",
            "identifier": "V12.1.2",
            "text": "Vérifiez que seules les suites de chiffrement recommandées sont activées, les suites de chiffrement les plus puissantes étant définies comme préférées. Les applications L3 doivent uniquement prendre en charge les suites de chiffrement assurant la confidentialité persistante (forward secrecy).",
            "parent": "V12.1"
          },
          {
            "bom-ref": "V12.1.3",
            "identifier": "V12.1.3",
            "text": "Vérifiez que l’application valide que les certificats clients mTLS sont approuvés avant d’utiliser l’identité du certificat pour l’authentification ou l’autorisation.",
            "parent": "V12.1"
          },
          {
            "bom-ref": "V12.1.4",
            "identifier": "V12.1.4",
            "text": "Vérifiez que la révocation de certification appropriée, telle que l'agrafage du protocole OCSP (Online Certificate Status Protocol), est activée et configurée.",
            "parent": "V12.1"
          },
          {
            "bom-ref": "V12.1.5",
            "identifier": "V12.1.5",
            "text": "Vérifiez que Encrypted Client Hello (ECH) est activé dans les paramètres TLS de l'application pour empêcher l'exposition de métadonnées sensibles, telles que l'indication du nom du serveur (SNI), pendant les processus de négociation TLS.",
            "parent": "V12.1"
          },
          {
            "bom-ref": "V12.2",
            "identifier": "V12.2",
            "title": "Communication HTTPS avec des services externes",
            "parent": "V12"
          },
          {
            "bom-ref": "V12.2.1",
            "identifier": "V12.2.1",
            "text": "Vérifiez que TLS est utilisé pour toute connectivité entre un client et des services externes basés sur HTTP, et ne recourt pas à des communications non sécurisées ou non chiffrées.",
            "parent": "V12.2"
          },
          {
            "bom-ref": "V12.2.2",
            "identifier": "V12.2.2",
            "text": "Vérifiez que les services externes utilisent des certificats TLS publiquement approuvés.",
            "parent": "V12.2"
          },
          {
            "bom-ref": "V12.3",
            "identifier": "V12.3",
            "title": "Sécurité des communications entre services généraux",
            "parent": "V12"
          },
          {
            "bom-ref": "V12.3.1",
            "identifier": "V12.3.1",
            "text": "Vérifiez qu'un protocole chiffré tel que TLS est utilisé pour toutes les connexions entrantes et sortantes vers et depuis l'application, y compris les systèmes de surveillance, les outils de gestion, l'accès à distance et SSH, les intergiciels, les bases de données, les mainframes, les systèmes partenaires ou les API externes. Le serveur ne doit pas recourir à des protocoles non sécurisés ou non chiffrés.",
            "parent": "V12.3"
          },
          {
            "bom-ref": "V12.3.2",
            "identifier": "V12.3.2",
            "text": "Vérifiez que les clients TLS valident les certificats reçus avant de communiquer avec un serveur TLS.",
            "parent": "V12.3"
          },
          {
            "bom-ref": "V12.3.3",
            "identifier": "V12.3.3",
            "text": "Vérifiez que TLS ou un autre mécanisme de chiffrement de transport approprié est utilisé pour toute connectivité entre les services internes basés sur HTTP au sein de l'application et ne se replie pas vers des communications non sécurisées ou non chiffrées.",
            "parent": "V12.3"
          },
          {
            "bom-ref": "V12.3.4",
            "identifier": "V12.3.4",
            "text": "Vérifiez que les connexions TLS entre les services internes utilisent des certificats de confiance. Lorsque des certificats générés en interne ou auto-signés sont utilisés, le service consommateur doit être configuré pour n'approuver que des autorités de certification internes spécifiques et des certificats auto-signés spécifiques.",
            "parent": "V12.3"
          },
          {
            "bom-ref": "V12.3.5",
            "identifier": "V12.3.5",
            "text": "Vérifiez que les services communiquant en interne au sein d'un système (communications intra-services) utilisent une authentification forte pour garantir la vérification de chaque endpoint. Des méthodes d'authentification forte, telles que l'authentification client TLS, doivent être utilisées pour garantir l'identité, en utilisant une infrastructure à clé publique et des mécanismes résistants aux attaques par rejeu. Pour les architectures de microservices, envisagez d'utiliser un maillage de services pour simplifier la gestion des certificats et renforcer la sécurité.",
            "parent": "V12.3"
          },
          {
            "bom-ref": "V13",
            "identifier": "V13",
            "title": "Configuration"
          },
          {
            "bom-ref": "V13.1",
            "identifier": "V13.1",
            "title": "Documentation de configuration",
            "parent": "V13"
          },
          {
            "bom-ref": "V13.1.1",
            "identifier": "V13.1.1",
            "text": "Vérifiez que tous les besoins de communication de l'application sont documentés. Cela doit inclure les services externes dont l'application dépend et les cas où un utilisateur final pourrait fournir un emplacement externe auquel l'application se connectera.",
            "parent": "V13.1"
          },
          {
            "bom-ref": "V13.1.2",
            "identifier": "V13.1.2",
            "text": "Vérifiez que pour chaque service utilisé par l'application, la documentation définit le nombre maximal de connexions simultanées (par exemple, les limites du pool de connexions) et le comportement de l'application lorsque cette limite est atteinte, y compris les mécanismes de secours ou de récupération, pour éviter les conditions de déni de service.",
            "parent": "V13.1"
          },
          {
            "bom-ref": "V13.1.3",
            "identifier": "V13.1.3",
            "text": "Vérifiez que la documentation de l'application définit des stratégies de gestion des ressources pour chaque système ou service externe utilisé (par exemple, bases de données, descripteurs de fichiers, threads, connexions HTTP). Cela doit inclure les procédures de libération des ressources, les paramètres de délai d'expiration, la gestion des échecs et l'implémentation de la logique de nouvelle tentative, en spécifiant les limites de nouvelle tentative, les délais et les algorithmes de retour arrière. Pour les opérations de requête-réponse HTTP synchrones, la documentation doit imposer des délais d'expiration courts et soit désactiver les nouvelles tentatives, soit les limiter strictement afin d'éviter les retards en cascade et l'épuisement des ressources.",
            "parent": "V13.1"
          },
          {
            "bom-ref": "V13.1.4",
            "identifier": "V13.1.4",
            "text": "Vérifiez que la documentation de l'application définit les secrets essentiels à la sécurité de l'application et un calendrier de rotation de ceux-ci, en fonction du modèle de menace et des exigences commerciales de l'organisation.",
            "parent": "V13.1"
          },
          {
            "bom-ref": "V13.2",
            "identifier": "V13.2",
            "title": "Configuration de la communication backend",
            "parent": "V13"
          },
          {
            "bom-ref": "V13.2.1",
            "identifier": "V13.2.1",
            "text": "Vérifiez que les communications entre les composants de l'application backend qui ne prennent pas en charge le mécanisme de session utilisateur standard de l'application, notamment les API, les intergiciels et les couches de données, sont authentifiées. L'authentification doit utiliser des comptes de service individuels, des jetons à court terme ou une authentification par certificat, et non des identifiants immuables tels que des mots de passe, des clés API ou des comptes partagés avec accès privilégié.",
            "parent": "V13.2"
          },
          {
            "bom-ref": "V13.2.2",
            "identifier": "V13.2.2",
            "text": "Vérifiez que les communications entre les composants de l'application backend, y compris les services locaux ou du système d'exploitation, les API, les intergiciels et les couches de données, sont effectuées avec des comptes dotés des privilèges les moins nécessaires.",
            "parent": "V13.2"
          },
          {
            "bom-ref": "V13.2.3",
            "identifier": "V13.2.3",
            "text": "Vérifiez que si des informations d’identification doivent être utilisées pour l’authentification du service, les informations d’identification utilisées par le consommateur ne sont pas des informations d’identification par défaut (par exemple, root/root ou admin/admin).",
            "parent": "V13.2"
          },
          {
            "bom-ref": "V13.2.4",
            "identifier": "V13.2.4",
            "text": "Vérifiez qu'une liste d’autorisations est utilisée pour définir les ressources ou systèmes externes avec lesquels l'application est autorisée à communiquer (par exemple, pour les requêtes sortantes, les chargements de données ou l'accès aux fichiers). Cette liste d'autorisation peut être implémentée au niveau de la couche applicative, du serveur web, du pare-feu ou d'une combinaison de différentes couches.",
            "parent": "V13.2"
          },
          {
            "bom-ref": "V13.2.5",
            "identifier": "V13.2.5",
            "text": "Vérifiez que le serveur Web ou d’application est configuré avec une liste autorisée de ressources ou de systèmes vers lesquels le serveur peut envoyer des requêtes ou charger des données ou des fichiers.",
            "parent": "V13.2"
          },
          {
            "bom-ref": "V13.2.6",
            "identifier": "V13.2.6",
            "text": "Vérifiez que lorsque l'application se connecte à des services distincts, elle suit la configuration documentée pour chaque connexion, comme le nombre maximal de connexions parallèles, le comportement lorsque le nombre maximal de connexions autorisées est atteint, les délais d'expiration de connexion et les stratégies de nouvelle tentative.",
            "parent": "V13.2"
          },
          {
            "bom-ref": "V13.3",
            "identifier": "V13.3",
            "title": "Gestion des secrets",
            "parent": "V13"
          },
          {
            "bom-ref": "V13.3.1",
            "identifier": "V13.3.1",
            "text": "Vérifiez qu'une solution de gestion des secrets, telle qu'un coffre-fort de clés, est utilisée pour créer, stocker, contrôler l'accès et détruire en toute sécurité les secrets backend. Ceux-ci peuvent inclure des mots de passe, du matériel de clé, des intégrations avec des bases de données et des systèmes tiers, des clés et des graines pour des jetons temporels, d'autres secrets internes et des clés API. Les secrets ne doivent pas être inclus dans le code source de l'application ni dans les artefacts de build. Pour une application L3, cela doit impliquer une solution matérielle telle qu'un HSM.",
            "parent": "V13.3"
          },
          {
            "bom-ref": "V13.3.2",
            "identifier": "V13.3.2",
            "text": "Vérifiez que l’accès aux ressources secrètes respecte le principe du moindre privilège.",
            "parent": "V13.3"
          },
          {
            "bom-ref": "V13.3.3",
            "identifier": "V13.3.3",
            "text": "Vérifiez que toutes les opérations cryptographiques sont effectuées à l'aide d'un module de sécurité isolé (tel qu'un coffre-fort ou un module de sécurité matériel) pour gérer et protéger en toute sécurité le matériel clé contre toute exposition en dehors du module de sécurité.",
            "parent": "V13.3"
          },
          {
            "bom-ref": "V13.3.4",
            "identifier": "V13.3.4",
            "text": "Vérifiez que les secrets sont configurés pour expirer et être renouvelés en fonction de la documentation de l'application.",
            "parent": "V13.3"
          },
          {
            "bom-ref": "V13.4",
            "identifier": "V13.4",
            "title": "Fuite d'informations involontaire",
            "parent": "V13"
          },
          {
            "bom-ref": "V13.4.1",
            "identifier": "V13.4.1",
            "text": "Vérifiez que l'application est déployée soit sans aucune métadonnée de contrôle de source, y compris les dossiers .git ou .svn, soit de manière à ce que ces dossiers soient inaccessibles à la fois en externe et à l'application elle-même.",
            "parent": "V13.4"
          },
          {
            "bom-ref": "V13.4.2",
            "identifier": "V13.4.2",
            "text": "Vérifiez que les modes de débogage sont désactivés pour tous les composants dans les environnements de production afin d’éviter l’exposition des fonctionnalités de débogage et la fuite d’informations.",
            "parent": "V13.4"
          },
          {
            "bom-ref": "V13.4.3",
            "identifier": "V13.4.3",
            "text": "Vérifiez que les serveurs Web n’exposent pas les listes de répertoires aux clients, sauf si cela est explicitement prévu.",
            "parent": "V13.4"
          },
          {
            "bom-ref": "V13.4.4",
            "identifier": "V13.4.4",
            "text": "Vérifiez que l’utilisation de la méthode HTTP TRACE n’est pas prise en charge dans les environnements de production, afin d’éviter toute fuite d’informations potentielle.",
            "parent": "V13.4"
          },
          {
            "bom-ref": "V13.4.5",
            "identifier": "V13.4.5",
            "text": "Vérifiez que la documentation (comme pour les API internes) et les endpoints de surveillance ne sont pas exposés, sauf si cela est explicitement prévu.",
            "parent": "V13.4"
          },
          {
            "bom-ref": "V13.4.6",
            "identifier": "V13.4.6",
            "text": "Vérifiez que l’application n’expose pas d’informations de version détaillées des composants backend.",
            "parent": "V13.4"
          },
          {
            "bom-ref": "V13.4.7",
            "identifier": "V13.4.7",
            "text": "Vérifiez que la couche web est configuré pour servir uniquement les fichiers avec des extensions de fichier spécifiques afin d’éviter toute fuite involontaire d’informations, de configuration et de code source.",
            "parent": "V13.4"
          },
          {
            "bom-ref": "V14",
            "identifier": "V14",
            "title": "Protection des données"
          },
          {
            "bom-ref": "V14.1",
            "identifier": "V14.1",
            "title": "Documentation sur la protection des données",
            "parent": "V14"
          },
          {
            "bom-ref": "V14.1.1",
            "identifier": "V14.1.1",
            "text": "Vérifiez que toutes les données sensibles créées et traitées par l'application ont été identifiées et classées selon leur niveau de protection. Cela inclut les données uniquement codées et donc facilement déchiffrables, telles que les chaînes Base64 ou la charge utile en texte clair d'un JWT. Les niveaux de protection doivent tenir compte des réglementations et normes de protection des données et de confidentialité auxquelles l'application est tenue de se conformer.",
            "parent": "V14.1"
          },
          {
            "bom-ref": "V14.1.2",
            "identifier": "V14.1.2",
            "text": "Vérifier que tous les niveaux de protection des données sensibles sont assortis d'un ensemble documenté d'exigences de protection. Cela doit inclure (sans s'y limiter) les exigences relatives au chiffrement général, à la vérification de l'intégrité, à la conservation, à la journalisation des données, aux contrôles d'accès aux données sensibles dans les journaux, au chiffrement au niveau de la base de données, aux technologies de confidentialité et de renforcement de la confidentialité à utiliser, ainsi qu'aux autres exigences de confidentialité.",
            "parent": "V14.1"
          },
          {
            "bom-ref": "V14.2",
            "identifier": "V14.2",
            "title": "Protection générale des données",
            "parent": "V14"
          },
          {
            "bom-ref": "V14.2.1",
            "identifier": "V14.2.1",
            "text": "Vérifiez que les données sensibles sont uniquement envoyées au serveur dans les champs de corps ou d’en-tête du message HTTP, et que l’URL et la chaîne de requête ne contiennent pas d’informations sensibles, telles qu’une clé API ou un jeton de session.",
            "parent": "V14.2"
          },
          {
            "bom-ref": "V14.2.2",
            "identifier": "V14.2.2",
            "text": "Vérifiez que l’application empêche la mise en cache des données sensibles dans les composants du serveur, tels que les équilibreurs de charge et les caches d’application, ou garantit que les données sont purgées en toute sécurité après utilisation.",
            "parent": "V14.2"
          },
          {
            "bom-ref": "V14.2.3",
            "identifier": "V14.2.3",
            "text": "Vérifiez que les données sensibles définies ne sont pas envoyées à des parties non fiables (par exemple, des trackers d'utilisateurs) pour empêcher la collecte indésirable de données en dehors du contrôle de l'application.",
            "parent": "V14.2"
          },
          {
            "bom-ref": "V14.2.4",
            "identifier": "V14.2.4",
            "text": "Vérifiez que les contrôles autour des données sensibles liés au chiffrement, à la vérification de l'intégrité, à la conservation, à la manière dont les données doivent être enregistrées, aux contrôles d'accès autour des données sensibles dans les journaux, à la confidentialité et aux technologies d'amélioration de la confidentialité, sont mis en œuvre comme défini dans la documentation pour le niveau de protection des données spécifiques.",
            "parent": "V14.2"
          },
          {
            "bom-ref": "V14.2.5",
            "identifier": "V14.2.5",
            "text": "Vérifiez que les mécanismes de mise en cache sont configurés pour ne mettre en cache que les réponses dont le type de contenu est conforme à la ressource et qui ne contiennent pas de contenu sensible et dynamique. Le serveur web doit renvoyer une réponse 404 ou 302 lors de l'accès à un fichier inexistant plutôt qu'un fichier valide différent. Cela devrait empêcher les attaques par empoisonnement de cache web.",
            "parent": "V14.2"
          },
          {
            "bom-ref": "V14.2.6",
            "identifier": "V14.2.6",
            "text": "Vérifiez que l'application ne renvoie que les données sensibles minimales requises pour son fonctionnement. Par exemple, ne renvoyez que certains chiffres d'un numéro de carte de crédit, et non le numéro complet. Si les données complètes sont requises, elles doivent être masquées dans l'interface utilisateur, sauf si l'utilisateur les consulte spécifiquement.",
            "parent": "V14.2"
          },
          {
            "bom-ref": "V14.2.7",
            "identifier": "V14.2.7",
            "text": "Vérifiez que les informations sensibles sont soumises à une classification de conservation des données, en veillant à ce que les données obsolètes ou inutiles soient supprimées automatiquement, selon un calendrier défini ou selon les besoins de la situation.",
            "parent": "V14.2"
          },
          {
            "bom-ref": "V14.2.8",
            "identifier": "V14.2.8",
            "text": "Vérifiez que les informations sensibles sont supprimées des métadonnées des fichiers soumis par l'utilisateur, sauf si le stockage est autorisé par l'utilisateur.",
            "parent": "V14.2"
          },
          {
            "bom-ref": "V14.3",
            "identifier": "V14.3",
            "title": "Protection des données côté client",
            "parent": "V14"
          },
          {
            "bom-ref": "V14.3.1",
            "identifier": "V14.3.1",
            "text": "Vérifiez que les données authentifiées sont effacées du stockage client, comme le DOM du navigateur, après la fin du client ou de la session. Le champ d'en-tête de réponse HTTP « Clear-Site-Data » peut être utile, mais le côté client devrait également pouvoir effectuer la correction si la connexion au serveur n'est pas disponible à la fin de la session.",
            "parent": "V14.3"
          },
          {
            "bom-ref": "V14.3.2",
            "identifier": "V14.3.2",
            "text": "Vérifiez que l'application définit suffisamment de champs d'en-tête de réponse HTTP anti-caching (c'est-à-dire Cache-Control : no-store) afin que les données sensibles ne soient pas mises en cache dans les navigateurs.",
            "parent": "V14.3"
          },
          {
            "bom-ref": "V14.3.3",
            "identifier": "V14.3.3",
            "text": "Vérifiez que les données stockées dans le stockage du navigateur (telles que localStorage, sessionStorage, IndexedDB ou les cookies) ne contiennent pas de données sensibles, à l'exception des jetons de session.",
            "parent": "V14.3"
          },
          {
            "bom-ref": "V15",
            "identifier": "V15",
            "title": "Développement et architecture sécurisés"
          },
          {
            "bom-ref": "V15.1",
            "identifier": "V15.1",
            "title": "Documentation sur le développement et l'architecture sécurisés",
            "parent": "V15"
          },
          {
            "bom-ref": "V15.1.1",
            "identifier": "V15.1.1",
            "text": "Vérifiez que la documentation de l'application définit les délais de correction basés sur les risques pour les versions de composants tiers présentant des vulnérabilités et pour la mise à jour des bibliothèques en général, afin de minimiser les risques liés à ces composants.",
            "parent": "V15.1"
          },
          {
            "bom-ref": "V15.1.2",
            "identifier": "V15.1.2",
            "text": "Vérifiez qu'un catalogue d'inventaire, tel qu'une nomenclature logicielle (SBOM), est conservé pour toutes les bibliothèques tierces utilisées, y compris en vérifiant que les composants proviennent de référentiels prédéfinis, fiables et continuellement maintenus.",
            "parent": "V15.1"
          },
          {
            "bom-ref": "V15.1.3",
            "identifier": "V15.1.3",
            "text": "Vérifiez que la documentation de l'application identifie les fonctionnalités consommatrices en temps ou gourmandes en ressources. Elle doit notamment indiquer comment prévenir une perte de disponibilité due à une utilisation excessive de ces fonctionnalités et éviter que la génération d'une réponse ne prenne plus de temps que le délai d'expiration du consommateur. Les mesures de protection potentielles peuvent inclure le traitement asynchrone, l'utilisation de files d'attente et la limitation des processus parallèles par utilisateur et par application.",
            "parent": "V15.1"
          },
          {
            "bom-ref": "V15.1.4",
            "identifier": "V15.1.4",
            "text": "Vérifiez que la documentation de l’application met en évidence les bibliothèques tierces qui sont considérées comme des « composants à risque ».",
            "parent": "V15.1"
          },
          {
            "bom-ref": "V15.1.5",
            "identifier": "V15.1.5",
            "text": "Vérifiez que la documentation de l’application met en évidence les parties de l’application où des « fonctionnalités dangereuses » sont utilisées.",
            "parent": "V15.1"
          },
          {
            "bom-ref": "V15.2",
            "identifier": "V15.2",
            "title": "Architecture de sécurité et dépendances",
            "parent": "V15"
          },
          {
            "bom-ref": "V15.2.1",
            "identifier": "V15.2.1",
            "text": "Vérifiez que l’application contient uniquement des composants qui n’ont pas dépassé les délais de mise à jour et de correction documentés.",
            "parent": "V15.2"
          },
          {
            "bom-ref": "V15.2.2",
            "identifier": "V15.2.2",
            "text": "Vérifiez que l'application a mis en œuvre des défenses contre la perte de disponibilité due à des fonctionnalités qui prennent du temps ou qui nécessitent des ressources, sur la base des décisions et stratégies de sécurité documentées à cet effet.",
            "parent": "V15.2"
          },
          {
            "bom-ref": "V15.2.3",
            "identifier": "V15.2.3",
            "text": "Vérifiez que l'environnement de production inclut uniquement les fonctionnalités nécessaires au fonctionnement de l'application et n'expose pas de fonctionnalités superflues telles que du code de test, des exemples d'extraits et des fonctionnalités de développement.",
            "parent": "V15.2"
          },
          {
            "bom-ref": "V15.2.4",
            "identifier": "V15.2.4",
            "text": "Vérifiez que les composants tiers et toutes leurs dépendances transitives sont inclus à partir du référentiel attendu, qu'il soit détenu en interne ou qu'il s'agisse d'une source externe, et qu'il n'y a aucun risque d'attaque par confusion de dépendances.",
            "parent": "V15.2"
          },
          {
            "bom-ref": "V15.2.5",
            "identifier": "V15.2.5",
            "text": "Vérifiez que l'application implémente des protections supplémentaires autour des parties documentées comme contenant des « fonctionnalités dangereuses » ou utilisant des bibliothèques tierces considérées comme des « composants à risque ». Cela peut inclure des techniques telles que le sandboxing, l'encapsulation, la conteneurisation ou l'isolation au niveau du réseau pour retarder et dissuader les attaquants qui compromettent une partie de l'application de se propager ailleurs.",
            "parent": "V15.2"
          },
          {
            "bom-ref": "V15.3",
            "identifier": "V15.3",
            "title": "Développement défensif",
            "parent": "V15"
          },
          {
            "bom-ref": "V15.3.1",
            "identifier": "V15.3.1",
            "text": "Vérifiez que l'application ne renvoie que le sous-ensemble requis de champs d'un objet de données. Par exemple, elle ne doit pas renvoyer un objet de données entier, car certains champs individuels ne doivent pas être accessibles aux utilisateurs.",
            "parent": "V15.3"
          },
          {
            "bom-ref": "V15.3.2",
            "identifier": "V15.3.2",
            "text": "Vérifiez que lorsque le backend de l'application effectue des appels vers des URL externes, il est configuré pour ne pas suivre les redirections, sauf s'il s'agit d'une fonctionnalité prévue.",
            "parent": "V15.3"
          },
          {
            "bom-ref": "V15.3.3",
            "identifier": "V15.3.3",
            "text": "Vérifiez que l'application dispose de contre-mesures pour se protéger contre les attaques d'affectation de masse en limitant les champs autorisés par contrôleur et action, par exemple, il n'est pas possible d'insérer ou de mettre à jour une valeur de champ lorsqu'elle n'était pas destinée à faire partie de cette action.",
            "parent": "V15.3"
          },
          {
            "bom-ref": "V15.3.4",
            "identifier": "V15.3.4",
            "text": "Vérifiez que tous les composants proxy et middleware transfèrent correctement l'adresse IP d'origine de l'utilisateur à l'aide de champs de données fiables qui ne peuvent pas être manipulés par l'utilisateur final, et que l'application et le serveur Web utilisent cette valeur correcte pour la journalisation et les décisions de sécurité telles que la limitation du débit, en tenant compte du fait que même l'adresse IP d'origine peut ne pas être fiable en raison d'adresses IP dynamiques, de VPN ou de pare-feu d'entreprise.",
            "parent": "V15.3"
          },
          {
            "bom-ref": "V15.3.5",
            "identifier": "V15.3.5",
            "text": "Vérifiez que l'application garantit explicitement que les variables sont du type correct et effectue des opérations d'égalité et de comparaison strictes. Cela permet d'éviter les vulnérabilités liées à la confusion de types, causées par des hypothèses du code de l'application sur le type d'une variable.",
            "parent": "V15.3"
          },
          {
            "bom-ref": "V15.3.6",
            "identifier": "V15.3.6",
            "text": "Vérifiez que le code JavaScript est écrit de manière à éviter la pollution du prototype, par exemple en utilisant Set() ou Map() au lieu de littéraux d'objet.",
            "parent": "V15.3"
          },
          {
            "bom-ref": "V15.3.7",
            "identifier": "V15.3.7",
            "text": "Vérifiez que l'application dispose de défenses contre les attaques de pollution des paramètres HTTP, en particulier si le Framework d'application ne fait aucune distinction quant à la source des paramètres de requête (chaîne de requête, paramètres de corps, cookies ou champs d'en-tête).",
            "parent": "V15.3"
          },
          {
            "bom-ref": "V15.4",
            "identifier": "V15.4",
            "title": "Concurrence sécurisée",
            "parent": "V15"
          },
          {
            "bom-ref": "V15.4.1",
            "identifier": "V15.4.1",
            "text": "Vérifiez que les objets partagés dans le code multithread (tels que les caches, les fichiers ou les objets en mémoire accessibles par plusieurs threads) sont accessibles en toute sécurité à l'aide de types thread-safe et de mécanismes de synchronisation tels que des verrous ou des sémaphores pour éviter les conditions de concurrence et la corruption des données.",
            "parent": "V15.4"
          },
          {
            "bom-ref": "V15.4.2",
            "identifier": "V15.4.2",
            "text": "Vérifiez que les vérifications de l'état d'une ressource, comme son existence ou ses autorisations, et des actions qui en dépendent, sont effectuées en une seule opération atomique afin d'éviter les situations de concurrence entre le moment de la vérification et le moment de l'utilisation (TOCTOU). Par exemple, vérifier l'existence d'un fichier avant de l'ouvrir ou l'accès d'un utilisateur avant de l'accorder.",
            "parent": "V15.4"
          },
          {
            "bom-ref": "V15.4.3",
            "identifier": "V15.4.3",
            "text": "Vérifiez que les verrous sont utilisés de manière cohérente pour éviter que les threads ne se bloquent, que ce soit en s'attendant les uns les autres ou en réessayant sans fin, et que la logique de verrouillage reste dans le code responsable de la gestion de la ressource pour garantir que les verrous ne peuvent pas être modifiés par inadvertance ou de manière malveillante par des classes ou du code externes.",
            "parent": "V15.4"
          },
          {
            "bom-ref": "V15.4.4",
            "identifier": "V15.4.4",
            "text": "Vérifiez que les politiques d'allocation des ressources empêchent la saturation de threads en garantissant un accès équitable aux ressources, par exemple en exploitant les pools de threads, permettant aux threads de priorité inférieure de continuer dans un délai raisonnable.",
            "parent": "V15.4"
          },
          {
            "bom-ref": "V16",
            "identifier": "V16",
            "title": "Journalisation de sécurité et gestion des erreurs"
          },
          {
            "bom-ref": "V16.1",
            "identifier": "V16.1",
            "title": "Documentation sur la journalisation de sécurité",
            "parent": "V16"
          },
          {
            "bom-ref": "V16.1.1",
            "identifier": "V16.1.1",
            "text": "Vérifiez qu'il existe un inventaire documentant la journalisation effectuée à chaque couche de la pile technologique de l'application, les événements enregistrés, les formats de journal, l'endroit où cette journalisation est stockée, la manière dont elle est utilisée, la manière dont l'accès à celle-ci est contrôlé et la durée de conservation des journaux.",
            "parent": "V16.1"
          },
          {
            "bom-ref": "V16.2",
            "identifier": "V16.2",
            "title": "Journalisation générale",
            "parent": "V16"
          },
          {
            "bom-ref": "V16.2.1",
            "identifier": "V16.2.1",
            "text": "Vérifiez que chaque entrée de journal inclut les métadonnées nécessaires (telles que quand, où, qui, quoi) qui permettraient une enquête détaillée sur la chronologie lorsqu'un événement se produit.",
            "parent": "V16.2"
          },
          {
            "bom-ref": "V16.2.2",
            "identifier": "V16.2.2",
            "text": "Vérifiez que les sources de temps de tous les composants de journalisation sont synchronisées et que les horodatages des métadonnées des événements de sécurité utilisent le temps UTC ou incluent un décalage horaire explicite. L'UTC est recommandé pour garantir la cohérence entre les systèmes distribués et éviter toute confusion lors du passage à l'heure d'été.",
            "parent": "V16.2"
          },
          {
            "bom-ref": "V16.2.3",
            "identifier": "V16.2.3",
            "text": "Vérifiez que l’application stocke ou diffuse uniquement les journaux vers les fichiers et services documentés dans l’inventaire des journaux.",
            "parent": "V16.2"
          },
          {
            "bom-ref": "V16.2.4",
            "identifier": "V16.2.4",
            "text": "Vérifiez que les journaux peuvent être lus et corrélés par le processeur de journaux utilisé, de préférence en utilisant un format de journalisation commun.",
            "parent": "V16.2"
          },
          {
            "bom-ref": "V16.2.5",
            "identifier": "V16.2.5",
            "text": "Vérifiez que l'application applique la journalisation en fonction du niveau de protection des données lors de la journalisation de données sensibles. Par exemple, certaines données, comme les identifiants ou les informations de paiement, peuvent être interdites. D'autres données, comme les jetons de session, ne peuvent être enregistrées que par hachage ou masquage, en totalité ou en partie.",
            "parent": "V16.2"
          },
          {
            "bom-ref": "V16.3",
            "identifier": "V16.3",
            "title": "Événements de sécurité",
            "parent": "V16"
          },
          {
            "bom-ref": "V16.3.1",
            "identifier": "V16.3.1",
            "text": "Vérifiez que toutes les opérations d'authentification sont enregistrées, y compris les tentatives réussies et infructueuses. Des métadonnées supplémentaires, telles que le type d'authentification ou les facteurs utilisés, doivent également être collectées.",
            "parent": "V16.3"
          },
          {
            "bom-ref": "V16.3.2",
            "identifier": "V16.3.2",
            "text": "Vérifier que les tentatives d'autorisation infructueuses sont logguées. Pour le niveau 3, cela doit inclure la journalisation de toutes les décisions d'autorisation, y compris lors de l'accès à des données sensibles (sans journalisation des données sensibles elles-mêmes).",
            "parent": "V16.3"
          },
          {
            "bom-ref": "V16.3.3",
            "identifier": "V16.3.3",
            "text": "Vérifiez que l'application enregistre les événements de sécurité définis dans la documentation et enregistre également les tentatives de contournement des contrôles de sécurité, tels que la validation des entrées, la logique métier et l'anti-automatisation.",
            "parent": "V16.3"
          },
          {
            "bom-ref": "V16.3.4",
            "identifier": "V16.3.4",
            "text": "Vérifiez que l’application enregistre les erreurs inattendues et les échecs de contrôle de sécurité tels que les échecs TLS du backend.",
            "parent": "V16.3"
          },
          {
            "bom-ref": "V16.4",
            "identifier": "V16.4",
            "title": "Protection des journaux",
            "parent": "V16"
          },
          {
            "bom-ref": "V16.4.1",
            "identifier": "V16.4.1",
            "text": "Vérifiez que tous les composants de journalisation codent correctement les données pour empêcher l’injection de journaux.",
            "parent": "V16.4"
          },
          {
            "bom-ref": "V16.4.2",
            "identifier": "V16.4.2",
            "text": "Vérifiez que les journaux sont protégés contre tout accès non autorisé et ne peuvent pas être modifiés.",
            "parent": "V16.4"
          },
          {
            "bom-ref": "V16.4.3",
            "identifier": "V16.4.3",
            "text": "Vérifiez que les journaux sont transmis de manière sécurisée à un système logique distinct pour analyse, détection, alerte et remontée des informations. L'objectif est de garantir qu'en cas de violation de l'application, les journaux ne seront pas compromis.",
            "parent": "V16.4"
          },
          {
            "bom-ref": "V16.5",
            "identifier": "V16.5",
            "title": "Gestion des erreurs",
            "parent": "V16"
          },
          {
            "bom-ref": "V16.5.1",
            "identifier": "V16.5.1",
            "text": "Vérifiez qu'un message générique est renvoyé au consommateur lorsqu'une erreur inattendue ou sensible à la sécurité se produit, garantissant ainsi l'absence d'exposition de données système internes sensibles telles que les traces de pile, les requêtes, les clés secrètes et les jetons.",
            "parent": "V16.5"
          },
          {
            "bom-ref": "V16.5.2",
            "identifier": "V16.5.2",
            "text": "Vérifiez que l'application continue de fonctionner en toute sécurité lorsque l'accès aux ressources externes échoue, par exemple, en utilisant des modèles tels que des disjoncteurs ou une dégradation progressive.",
            "parent": "V16.5"
          },
          {
            "bom-ref": "V16.5.3",
            "identifier": "V16.5.3",
            "text": "Vérifiez que l'application échoue proprement et sécurisée, y compris lorsqu'une exception se produit, en évitant les accès en cas d'erreur telles que le traitement d'une transaction malgré les erreurs résultant de la logique de validation.",
            "parent": "V16.5"
          },
          {
            "bom-ref": "V16.5.4",
            "identifier": "V16.5.4",
            "text": "Vérifiez qu'un gestionnaire d'erreurs de « dernier recours » est défini pour intercepter toutes les exceptions non gérées. Cela permet d'éviter la perte des informations d'erreur qui doivent être loguées dans les fichiers journaux et de garantir qu'une erreur ne paralyse pas l'ensemble du processus applicatif, entraînant une perte de disponibilité.",
            "parent": "V16.5"
          },
          {
            "bom-ref": "V17",
            "identifier": "V17",
            "title": "WebRTC"
          },
          {
            "bom-ref": "V17.1",
            "identifier": "V17.1",
            "title": "Serveur TURN",
            "parent": "V17"
          },
          {
            "bom-ref": "V17.1.1",
            "identifier": "V17.1.1",
            "text": "Vérifiez que le service TURN (Traversal Using Relays around NAT) autorise uniquement l'accès aux adresses IP non réservées à des fins spécifiques (par exemple, réseaux internes, diffusion, bouclage). Notez que cela s'applique aux adresses IPv4 et IPv6.",
            "parent": "V17.1"
          },
          {
            "bom-ref": "V17.1.2",
            "identifier": "V17.1.2",
            "text": "Vérifiez que le service Traversal Using Relays around NAT (TURN) n'est pas susceptible d'épuiser ses ressources lorsque des utilisateurs légitimes tentent d'ouvrir un grand nombre de ports sur le serveur TURN.",
            "parent": "V17.1"
          },
          {
            "bom-ref": "V17.2",
            "identifier": "V17.2",
            "title": "Média",
            "parent": "V17"
          },
          {
            "bom-ref": "V17.2.1",
            "identifier": "V17.2.1",
            "text": "Vérifiez que la clé du certificat Datagram Transport Layer Security (DTLS) est gérée et protégée conformément à la politique documentée de gestion des clés cryptographiques.",
            "parent": "V17.2"
          },
          {
            "bom-ref": "V17.2.2",
            "identifier": "V17.2.2",
            "text": "Vérifiez que le serveur multimédia est configuré pour utiliser et prendre en charge les suites de chiffrement DTLS (Datagram Transport Layer Security) approuvées et un profil de protection sécurisé pour l'extension DTLS pour l'établissement de clés pour le protocole de transport en temps réel sécurisé (DTLS-SRTP).",
            "parent": "V17.2"
          },
          {
            "bom-ref": "V17.2.3",
            "identifier": "V17.2.3",
            "text": "Vérifiez que l'authentification SRTP (Secure Real-time Transport Protocol) est vérifiée sur le serveur multimédia pour empêcher les attaques par injection RTP (Real-time Transport Protocol) d'entraîner une condition de déni de service ou l'insertion de médias audio ou vidéo dans les flux multimédias.",
            "parent": "V17.2"
          },
          {
            "bom-ref": "V17.2.4",
            "identifier": "V17.2.4",
            "text": "Vérifiez que le serveur multimédia est en mesure de continuer à traiter le trafic multimédia entrant lorsqu'il rencontre des paquets SRTP (Secure Real-time Transport Protocol) mal formés.",
            "parent": "V17.2"
          },
          {
            "bom-ref": "V17.2.5",
            "identifier": "V17.2.5",
            "text": "Vérifiez que le serveur multimédia est en mesure de continuer à traiter le trafic multimédia entrant pendant un flot de paquets SRTP (Secure Real-time Transport Protocol) provenant d'utilisateurs légitimes.",
            "parent": "V17.2"
          },
          {
            "bom-ref": "V17.2.6",
            "identifier": "V17.2.6",
            "text": "Vérifiez que le serveur multimédia n'est pas sensible à la vulnérabilité de condition de concurrence « ClientHello » dans Datagram Transport Layer Security (DTLS) en vérifiant si le serveur multimédia est publiquement connu comme étant vulnérable ou en effectuant le test de condition de concurrence.",
            "parent": "V17.2"
          },
          {
            "bom-ref": "V17.2.7",
            "identifier": "V17.2.7",
            "text": "Vérifiez que tous les mécanismes d'enregistrement audio ou vidéo associés au serveur multimédia sont en mesure de continuer à traiter le trafic multimédia entrant pendant un flot de paquets SRTP (Secure Real-time Transport Protocol) provenant d'utilisateurs légitimes.",
            "parent": "V17.2"
          },
          {
            "bom-ref": "V17.2.8",
            "identifier": "V17.2.8",
            "text": "Vérifiez que le certificat Datagram Transport Layer Security (DTLS) est vérifié par rapport à l'attribut d'empreinte cryptographique du protocole de description de session (SDP), en mettant fin au flux multimédia si la vérification échoue, pour garantir l'authenticité du flux multimédia.",
            "parent": "V17.2"
          },
          {
            "bom-ref": "V17.3",
            "identifier": "V17.3",
            "title": "Signalisation",
            "parent": "V17"
          },
          {
            "bom-ref": "V17.3.1",
            "identifier": "V17.3.1",
            "text": "Vérifiez que le serveur de signalisation est capable de continuer à traiter les messages de signalisation entrants légitimes lors d'une attaque par saturation. Cela peut être réalisé en implémentant une limitation de débit au niveau de la signalisation.",
            "parent": "V17.3"
          },
          {
            "bom-ref": "V17.3.2",
            "identifier": "V17.3.2",
            "text": "Vérifiez que le serveur de signalisation est capable de continuer à traiter les messages de signalisation légitimes en cas de message mal formé susceptible de provoquer un déni de service. Cela peut inclure la validation des entrées, la gestion sécurisée des dépassements d'entiers, la prévention des dépassements de tampon et l'utilisation d'autres techniques robustes de gestion des erreurs.",
            "parent": "V17.3"
          }
        ],
        "levels": [
          {
            "bom-ref": "level-1",
            "identifier": "Level 1",
            "description": "This level contains the minimum requirements to consider when securing an application and represents a critical starting point.",
            "requirements": [
              "V1.2.1",
              "V1.2.2",
              "V1.2.3",
              "V1.2.4",
              "V1.2.5",
              "V1.3.1",
              "V1.3.2",
              "V1.5.1",
              "V2.1.1",
              "V2.2.1",
              "V2.2.2",
              "V2.3.1",
              "V3.2.1",
              "V3.2.2",
              "V3.3.1",
              "V3.4.1",
              "V3.4.2",
              "V3.5.1",
              "V3.5.2",
              "V3.5.3",
              "V4.1.1",
              "V4.4.1",
              "V5.2.1",
              "V5.2.2",
              "V5.3.1",
              "V5.3.2",
              "V6.1.1",
              "V6.2.1",
              "V6.2.2",
              "V6.2.3",
              "V6.2.4",
              "V6.2.5",
              "V6.2.6",
              "V6.2.7",
              "V6.2.8",
              "V6.3.1",
              "V6.3.2",
              "V6.4.1",
              "V6.4.2",
              "V7.2.1",
              "V7.2.2",
              "V7.2.3",
              "V7.2.4",
              "V7.4.1",
              "V7.4.2",
              "V8.1.1",
              "V8.2.1",
              "V8.2.2",
              "V8.3.1",
              "V9.1.1",
              "V9.1.2",
              "V9.1.3",
              "V9.2.1",
              "V10.4.1",
              "V10.4.2",
              "V10.4.3",
              "V10.4.4",
              "V10.4.5",
              "V11.3.1",
              "V11.3.2",
              "V11.4.1",
              "V12.1.1",
              "V12.2.1",
              "V12.2.2",
              "V13.4.1",
              "V14.2.1",
              "V14.3.1",
              "V15.1.1",
              "V15.2.1",
              "V15.3.1"
            ]
          },
          {
            "bom-ref": "level-2",
            "identifier": "Level 2",
            "description": "ASVS Level 2 requirements generally relate to either less common attacks or more complicated protections against common attacks. They may still be a first layer of defense, or they may require certain preconditions for the attack to be successful.",
            "requirements": [
              "V1.1.1",
              "V1.1.2",
              "V1.2.6",
              "V1.2.7",
              "V1.2.8",
              "V1.2.9",
              "V1.3.3",
              "V1.3.4",
              "V1.3.5",
              "V1.3.6",
              "V1.3.7",
              "V1.3.8",
              "V1.3.9",
              "V1.3.10",
              "V1.3.11",
              "V1.4.1",
              "V1.4.2",
              "V1.4.3",
              "V1.5.2",
              "V2.1.2",
              "V2.1.3",
              "V2.2.3",
              "V2.3.2",
              "V2.3.3",
              "V2.3.4",
              "V2.4.1",
              "V3.3.2",
              "V3.3.3",
              "V3.3.4",
              "V3.4.3",
              "V3.4.4",
              "V3.4.5",
              "V3.4.6",
              "V3.5.4",
              "V3.5.5",
              "V3.7.1",
              "V3.7.2",
              "V4.1.2",
              "V4.1.3",
              "V4.2.1",
              "V4.3.1",
              "V4.3.2",
              "V4.4.2",
              "V4.4.3",
              "V4.4.4",
              "V5.1.1",
              "V5.2.3",
              "V5.4.1",
              "V5.4.2",
              "V5.4.3",
              "V6.1.2",
              "V6.1.3",
              "V6.2.9",
              "V6.2.10",
              "V6.2.11",
              "V6.2.12",
              "V6.3.3",
              "V6.3.4",
              "V6.4.3",
              "V6.4.4",
              "V6.5.1",
              "V6.5.2",
              "V6.5.3",
              "V6.5.4",
              "V6.5.5",
              "V6.6.1",
              "V6.6.2",
              "V6.6.3",
              "V6.8.1",
              "V6.8.2",
              "V6.8.3",
              "V6.8.4",
              "V7.1.1",
              "V7.1.2",
              "V7.1.3",
              "V7.3.1",
              "V7.3.2",
              "V7.4.3",
              "V7.4.4",
              "V7.4.5",
              "V7.5.1",
              "V7.5.2",
              "V7.6.1",
              "V7.6.2",
              "V8.1.2",
              "V8.2.3",
              "V8.4.1",
              "V9.2.2",
              "V9.2.3",
              "V9.2.4",
              "V10.1.1",
              "V10.1.2",
              "V10.2.1",
              "V10.2.2",
              "V10.3.1",
              "V10.3.2",
              "V10.3.3",
              "V10.3.4",
              "V10.4.6",
              "V10.4.7",
              "V10.4.8",
              "V10.4.9",
              "V10.4.10",
              "V10.4.11",
              "V10.5.1",
              "V10.5.2",
              "V10.5.3",
              "V10.5.4",
              "V10.5.5",
              "V10.6.1",
              "V10.6.2",
              "V10.7.1",
              "V10.7.2",
              "V10.7.3",
              "V11.1.1",
              "V11.1.2",
              "V11.2.1",
              "V11.2.2",
              "V11.2.3",
              "V11.3.3",
              "V11.4.2",
              "V11.4.3",
              "V11.4.4",
              "V11.5.1",
              "V11.6.1",
              "V12.1.2",
              "V12.1.3",
              "V12.3.1",
              "V12.3.2",
              "V12.3.3",
              "V12.3.4",
              "V13.1.1",
              "V13.2.1",
              "V13.2.2",
              "V13.2.3",
              "V13.2.4",
              "V13.2.5",
              "V13.3.1",
              "V13.3.2",
              "V13.4.2",
              "V13.4.3",
              "V13.4.4",
              "V13.4.5",
              "V14.1.1",
              "V14.1.2",
              "V14.2.2",
              "V14.2.3",
              "V14.2.4",
              "V14.3.2",
              "V14.3.3",
              "V15.1.2",
              "V15.1.3",
              "V15.2.2",
              "V15.2.3",
              "V15.3.2",
              "V15.3.3",
              "V15.3.4",
              "V15.3.5",
              "V15.3.6",
              "V15.3.7",
              "V16.1.1",
              "V16.2.1",
              "V16.2.2",
              "V16.2.3",
              "V16.2.4",
              "V16.2.5",
              "V16.3.1",
              "V16.3.2",
              "V16.3.3",
              "V16.3.4",
              "V16.4.1",
              "V16.4.2",
              "V16.4.3",
              "V16.5.1",
              "V16.5.2",
              "V16.5.3",
              "V17.1.1",
              "V17.2.1",
              "V17.2.2",
              "V17.2.3",
              "V17.2.4",
              "V17.3.1",
              "V17.3.2"
            ]
          },
          {
            "bom-ref": "level-3",
            "identifier": "Level 3",
            "description": "ASVS Level 3 should be the goal for applications looking to demonstrate the highest levels of security and requirements in this section are generally either defense-in-depth mechanisms or other useful but hard-to-implement controls.",
            "requirements": [
              "V1.2.10",
              "V1.3.12",
              "V1.5.3",
              "V2.3.5",
              "V2.4.2",
              "V3.1.1",
              "V3.2.3",
              "V3.3.5",
              "V3.4.7",
              "V3.4.8",
              "V3.5.6",
              "V3.5.7",
              "V3.5.8",
              "V3.6.1",
              "V3.7.3",
              "V3.7.4",
              "V3.7.5",
              "V4.1.4",
              "V4.1.5",
              "V4.2.2",
              "V4.2.3",
              "V4.2.4",
              "V4.2.5",
              "V5.2.4",
              "V5.2.5",
              "V5.2.6",
              "V5.3.3",
              "V6.3.5",
              "V6.3.6",
              "V6.3.7",
              "V6.3.8",
              "V6.4.5",
              "V6.4.6",
              "V6.5.6",
              "V6.5.7",
              "V6.5.8",
              "V6.6.4",
              "V6.7.1",
              "V6.7.2",
              "V7.5.3",
              "V8.1.3",
              "V8.1.4",
              "V8.2.4",
              "V8.3.2",
              "V8.3.3",
              "V8.4.2",
              "V10.2.3",
              "V10.3.5",
              "V10.4.12",
              "V10.4.13",
              "V10.4.14",
              "V10.4.15",
              "V10.4.16",
              "V11.1.3",
              "V11.1.4",
              "V11.2.4",
              "V11.2.5",
              "V11.3.4",
              "V11.3.5",
              "V11.5.2",
              "V11.6.2",
              "V11.7.1",
              "V11.7.2",
              "V12.1.4",
              "V12.1.5",
              "V12.3.5",
              "V13.1.2",
              "V13.1.3",
              "V13.1.4",
              "V13.2.6",
              "V13.3.3",
              "V13.3.4",
              "V13.4.6",
              "V13.4.7",
              "V14.2.5",
              "V14.2.6",
              "V14.2.7",
              "V14.2.8",
              "V15.1.4",
              "V15.1.5",
              "V15.2.4",
              "V15.2.5",
              "V15.4.1",
              "V15.4.2",
              "V15.4.3",
              "V15.4.4",
              "V16.5.4",
              "V17.1.2",
              "V17.2.5",
              "V17.2.6",
              "V17.2.7",
              "V17.2.8"
            ]
          }
        ],
        "externalReferences": [
          {
            "type": "website",
            "url": "https://owasp.org/asvs"
          },
          {
            "type": "vcs",
            "url": "https://github.com/OWASP/ASVS"
          },
          {
            "type": "issue-tracker",
            "url": "https://github.com/OWASP/ASVS/issues"
          },
          {
            "type": "social",
            "url": "https://twitter.com/OWASP_ASVS"
          }
        ]
      }
    ]
  }
}
